{
  "HOME_PAGE": {
    "title": "Startseite",
    "link": "Startseite",
    "caption": "Moderne Websites, mobile Anwendungen und IT-Systeme – umfassende technologische Unterstützung.",
    "metadata": {
      "title": "Hello Software – Moderne Web- & App-Entwicklung",
      "description": "Softwarehaus, das sich mit der Erstellung von Websites, Mobil- und Webanwendungen beschäftigt und Ihrem Unternehmen umfassenden technischen Support bietet."
    },
    "HERO_SECTION": {
      "text": "Wir sind ein erfahrenes Softwarehaus, das leistungsstarke IT-Lösungen entwickelt – individuell angepasst an die Anforderungen Ihres Unternehmens. Ob moderne Website, mobile App für iOS & Android oder skalierbare E-Commerce-Plattform – wir liefern schnelle, sichere und SEO-optimierte Ergebnisse. Suchen Sie einen zuverlässigen Technologiepartner? Kontaktieren Sie uns – gemeinsam realisieren wir Ihr digitales Projekt!",
      "button": "Kontaktieren Sie uns"
    },
    "SERVICES_SECTION": {},
    "HOW_IT_WORK_SECTION": {
      "title": "Softwareentwicklungsprozess",
      "caption": "Erfahren Sie alle Phasen unserer Entwicklung – von Strategie und Design bis zur Veröffentlichung und Optimierung. Wir vereinfachen komplexe Abläufe und liefern schnelle, skalierbare und benutzerfreundliche Lösungen.",
      "steps": [
        {
          "title": "Strategie & UX-Design",
          "description": "Wir definieren die Geschäftsziele, Zielgruppe und Hauptfunktionen Ihrer Website. Mit Wireframes und hochauflösenden Mockups schaffen wir eine benutzerfreundliche und conversion-optimierte Struktur."
        },
        {
          "title": "Frontend- & Backend-Entwicklung",
          "description": "Wir setzen genehmigte Designs mit modernen Technologien wie React um und entwickeln bei Bedarf eine skalierbare Backend-Architektur für optimale Performance."
        },
        {
          "title": "Qualitätssicherung & Launch",
          "description": "Wir testen die Website umfassend auf Leistung, Responsivität, SEO-Tauglichkeit und Sicherheit. Nach Optimierung wird die Seite auf einem zuverlässigen Server mit Analytics-Integration veröffentlicht."
        }
      ],
      "STATS_SECTION": [
        { "title": "5+", "caption": "Jahre Erfahrung" },
        { "title": "Weltweit", "caption": "Aus Polen, weltweit verfügbar" },
        { "title": "+100%", "caption": "Wachstum seit dem Start" }
      ]
    },
    "CONNTACT_SECTION": {
      "form": {
        "title": "Benötigen Sie eine Website oder App?",
        "caption": "Schreiben Sie uns",
        "input": {
          "email": {
            "placeholder": "E-Mail-Adresse *",
            "error": "Bitte geben Sie eine gültige E-Mail-Adresse ein"
          },
          "name": {
            "placeholder": "Name",
            "error": "Bitte geben Sie einen gültigen Namen ein"
          },
          "phone": {
            "placeholder": "Telefonnummer",
            "error": "Bitte geben Sie eine gültige Telefonnummer ein"
          },
          "message": {
            "placeholder": "Beschreiben Sie Ihr Projekt *",
            "error": "Die Projektbeschreibung muss mindestens 10 Zeichen enthalten"
          }
        },
        "submit": "Nachricht senden",
        "sending": "Wird gesendet...",
        "success": "Nachricht erfolgreich gesendet. Wir melden uns bald bei Ihnen!",
        "error": "Etwas ist schiefgelaufen. Bitte versuchen Sie es später noch einmal."
      },
      "informations": {
        "title": "Kontaktinformationen",
        "caption": "Kontaktieren Sie uns – wir beraten Sie, schlagen Lösungen vor und erstellen ein individuelles Angebot",
        "location": {
          "title": "Standort",
          "detail": "Wrocław, Polen"
        },
        "mail": {
          "title": "Schreiben Sie uns",
          "detail": "contact@hello-software.com"
        }
      }
    }
  },
  "SERVICES": {
    "title": "Dienstleistungen",
    "link": "Dienstleistungen",
    "caption": "Informieren Sie sich über unser umfassendes Angebot an Programmierdiensten, die Ihrem Unternehmen zur Verfügung stehen.",
    "motto": "Verwandeln Sie Ihre Idee in ein erfolgreiches Geschäft",
    "metadata": {
      "title": "IT-Dienstleistungen – Hello Software",
      "description": "Umfassende IT-Dienstleistungen: Websites, Mobile Apps, API-Integrationen und Cloud-Lösungen."
    },
    "section": {
      "title": "Moderne Dienstleistungen, die wir anbieten",
      "motto": "Verwandeln Sie Ihre Idee in ein erfolgreiches Geschäft"
    },
    "STATS_SECTION": [
      { "title": "5+", "caption": "Jahre Erfahrung" },
      { "title": "Weltweit", "caption": "Aus Polen, weltweit verfügbar" },
      { "title": "+100%", "caption": "Wachstum seit dem Start" }
    ]
  },
  "WEBSITES": {
    "title": "Webseiten",
    "link": "Webseiten",
    "button": { "read_more": "Weiterlesen" },
    "caption": "Individuelles Webdesign und Entwicklung – schnell, modern und SEO-optimiert.",
    "metadata": {
      "title": "Webseiten – Hello Software",
      "description": "Wir erstellen moderne, schnelle und suchmaschinenoptimierte Webseiten mit bester User Experience."
    }
  },
  "E_COMMERCE": {
    "title": "E-Commerce",
    "link": "E-Commerce",
    "button": { "read_more": "Weiterlesen" },
    "caption": "Skalierbare und sichere E-Commerce-Lösungen – konversionsstark und wachstumsorientiert.",
    "metadata": {
      "title": "E-Commerce – Hello Software",
      "description": "Wir entwickeln sichere und skalierbare Online-Shops mit Fokus auf Leistung und Konvertierung."
    }
  },
  "WEB_APPLICATIONS": {
    "title": "Webanwendungen",
    "link": "Webanwendungen",
    "button": { "read_more": "Weiterlesen" },
    "caption": "Leistungsstarke und skalierbare Webanwendungen – mit modernsten Technologien entwickelt.",
    "metadata": {
      "title": "Webanwendungen – Hello Software",
      "description": "Wir entwickeln maßgeschneiderte Webanwendungen – leistungsstark, sicher und modern."
    }
  },
  "MOBILE_APPLICATIONS": {
    "title": "Mobile Apps",
    "link": "Mobile Apps",
    "button": { "read_more": "Weiterlesen" },
    "caption": "Android- & iOS-Apps – nahtlos, leistungsfähig und benutzerfreundlich.",
    "metadata": {
      "title": "Mobile Apps – Hello Software",
      "description": "Wir entwickeln mobile Apps für Android und iOS – schnell, intuitiv und effizient."
    }
  },
  "SERVER_APPLICATIONS": {
    "title": "API & Systemintegrationen",
    "link": "API & Systemintegrationen",
    "button": { "read_more": "Weiterlesen" },
    "caption": "Nahtlose API-Entwicklung und Systemintegration – für mehr Automatisierung und Effizienz.",
    "metadata": {
      "title": "API & Systemintegrationen – Hello Software",
      "description": "Wir entwickeln APIs und Integrationen, die Systeme verbinden und Prozesse automatisieren."
    }
  },
  "SEARCH_ENGINE_OPTIMIZATION": {
    "title": "SEO",
    "link": "Suchmaschinenoptimierung (SEO)",
    "button": { "read_more": "Weiterlesen" },
    "caption": "Verbessern Sie Ihre Online-Sichtbarkeit mit professionellem SEO – mehr Traffic, bessere Rankings.",
    "metadata": {
      "title": "SEO – Hello Software",
      "description": "Steigern Sie Ihre Sichtbarkeit online mit effektiver Suchmaschinenoptimierung."
    }
  },
  "CLOUD_COMPUTING_SOLUTIONS": {
    "title": "Cloud-Lösungen",
    "link": "Cloud-Lösungen",
    "button": { "read_more": "Weiterlesen" },
    "caption": "Cloud-Lösungen für Unternehmen – sicher, skalierbar und leistungsoptimiert.",
    "metadata": {
      "title": "Cloud-Computing – Hello Software",
      "description": "Moderne und sichere Cloud-Lösungen, angepasst an Ihr Unternehmenswachstum."
    }
  },
  "OUTSOURCING": {
    "title": "IT-Outsourcing",
    "link": "IT-Outsourcing",
    "button": { "read_more": "Weiterlesen" },
    "caption": "Zuverlässiges IT-Outsourcing – effizient, kostengünstig und professionell.",
    "metadata": {
      "title": "IT-Outsourcing – Hello Software",
      "description": "Externe IT-Teams für mehr Effizienz – flexibel und budgetfreundlich."
    }
  },
  "TECHNOLOGIES": {
    "title": "Technologien",
    "link": "Technologien",
    "caption": "Die Technologien, die wir verwenden – modern, bewährt und zukunftssicher.",
    "metadata": {
      "title": "Technologien – Hello Software",
      "description": "Unsere bevorzugten Technologien für Webentwicklung, Apps und Skalierbarkeit."
    }
  },
  "TYPESCRIPT": {
    "title": "TypeScript",
    "link": "TypeScript",
    "caption": "Schnelle, skalierbare Entwicklung mit TypeScript – stark typisiert und zuverlässig.",
    "metadata": {
      "title": "TypeScript – Hello Software",
      "description": "Moderne Webentwicklung mit TypeScript – sicherer und wartbarer Code."
    }
  },
  "REACT": {
    "title": "React",
    "link": "React",
    "caption": "Benutzerfreundliche Frontends mit React – schnell, interaktiv und skalierbar.",
    "metadata": {
      "title": "React – Hello Software",
      "description": "Wir verwenden React für moderne, performante und wartbare Benutzeroberflächen."
    }
  },
  "NODE_JS": {
    "title": "Node.js",
    "link": "Node.js",
    "caption": "Skalierbare Backend-Lösungen mit Node.js – schnell, stabil und flexibel.",
    "metadata": {
      "title": "Node.js – Hello Software",
      "description": "Effiziente Serverlösungen mit Node.js für APIs, Backends und Integrationen."
    }
  },
  "REACT_NATIVE": {
    "title": "React Native",
    "link": "React Native",
    "caption": "Cross-Plattform-Mobile-Apps mit React Native – schnell und effektiv.",
    "metadata": {
      "title": "React Native – Hello Software",
      "description": "Mit React Native entwickeln wir native Mobile Apps für mehrere Plattformen gleichzeitig."
    }
  },
  "COMPANY": {
    "title": "Unternehmen",
    "link": "Über uns",
    "caption": "Lernen Sie unser Team, unsere Werte und unsere Vision kennen.",
    "metadata": {
      "title": "Über uns – Hello Software",
      "description": "Hello Software – Ihr Partner für innovative IT-Lösungen und individuelle Softwareentwicklung."
    },
    "sections_1": {
      "title": "Unsere Werte",
      "caption": "Das Fundament jedes erfolgreichen Projekts.",
      "text": "Bei Hello Software setzen wir auf Werte wie Transparenz, Innovation, Verantwortung und Engagement. Wir sind überzeugt, dass nur durch partnerschaftliche Zusammenarbeit und Ehrlichkeit erstklassige IT-Lösungen entstehen, die das Wachstum unserer Kunden nachhaltig fördern."
    },
    "sections_2": {
      "title": "Unsere Unternehmenskultur",
      "caption": "Ein Team, das von Leidenschaft und Respekt geprägt ist.",
      "text": "Wir schaffen ein Arbeitsumfeld, das auf Zusammenarbeit, offener Kommunikation und kontinuierlicher Weiterentwicklung basiert. Bei Hello Software hat jedes Teammitglied einen echten Einfluss auf Projekte und die Unternehmensentwicklung. Unsere Kultur ist geprägt von Feedback, Flexibilität und einem ausgewogenen Verhältnis zwischen Beruf und Privatleben – für mehr Effizienz und Kreativität."
    },
    "sections_3": {
      "title": "Unsere Vision",
      "caption": "Moderne Technologien im Dienst von Menschen und Unternehmen.",
      "text": "Unsere Vision ist es, intelligente, skalierbare und zugängliche IT-Lösungen zu entwickeln, die den Anforderungen eines sich ständig verändernden Marktes gerecht werden. Wir wollen ein zuverlässiger Technologiepartner für Unternehmen weltweit sein und sie bei der digitalen Transformation und Zielerreichung unterstützen."
    },
    "sections_4": {
      "title": "Warum wir?",
      "caption": "Ihre Ziele in den Händen erfahrener IT-Experten.",
      "text": "Mit Hello Software entscheiden Sie sich für einen Partner, der Ihre Anforderungen versteht und in wirkungsvolle digitale Lösungen umsetzt. Wir vereinen Erfahrung, moderne Ansätze und Transparenz. Jedes Projekt basiert auf fundierter Analyse, strategischer Planung und höchsten Qualitätsstandards – von der Idee bis zur Umsetzung und darüber hinaus."
    }
  },
  "CONTACT": {
    "title": "Kontaktieren Sie Hello Software",
    "link": "Kontakt",
    "caption": "Benötigen Sie eine Website, App oder eine E-Commerce-Lösung? Kontaktieren Sie unser IT-Expertenteam und besprechen Sie Ihr Projekt.",
    "metadata": {
      "title": "Kontakt – Hello Software | Professionelle IT-Dienstleistungen",
      "description": "Haben Sie eine Idee für ein digitales Projekt? Kontaktieren Sie Hello Software und erhalten Sie eine kostenlose Beratung zu Websites, mobilen Apps und individuellen Softwarelösungen."
    },
    "CONNTACT_SECTION": {
      "form": {
        "title": "Benötigen Sie eine Website oder App?",
        "caption": "Schreiben Sie uns",
        "input": {
          "email": {
            "placeholder": "E-Mail-Adresse *",
            "error": "Bitte geben Sie eine gültige E-Mail-Adresse ein"
          },
          "name": {
            "placeholder": "Name",
            "error": "Bitte geben Sie einen gültigen Namen ein"
          },
          "phone": {
            "placeholder": "Telefonnummer",
            "error": "Bitte geben Sie eine gültige Telefonnummer ein"
          },
          "message": {
            "placeholder": "Beschreiben Sie Ihr Projekt *",
            "error": "Die Projektbeschreibung muss mindestens 10 Zeichen enthalten"
          }
        },
        "submit": "Nachricht senden",
        "sending": "Wird gesendet...",
        "success": "Nachricht erfolgreich gesendet. Wir melden uns bald bei Ihnen!",
        "error": "Etwas ist schiefgelaufen. Bitte versuchen Sie es später noch einmal."
      },
      "informations": {
        "title": "Kontaktinformationen",
        "caption": "Kontaktieren Sie uns – wir beraten Sie, schlagen Lösungen vor und erstellen ein individuelles Angebot",
        "location": {
          "title": "Standort",
          "detail": "Wrocław, Polen"
        },
        "mail": {
          "title": "Schreiben Sie uns",
          "detail": "contact@hello-software.com"
        }
      }
    }
  },
  "SUPPORT": {
    "title": "Nützliche Links",
    "link": "Nützliche Links",
    "caption": "Zugriff auf wichtige Ressourcen, Dokumentationen und Richtlinien zu unseren Dienstleistungen.",
    "metadata": {
      "title": "Nützliche Links – Hello Software",
      "description": "Entdecken Sie hilfreiche Links und wichtige Ressourcen von Hello Software, um informiert und unterstützt zu bleiben."
    }
  },
  "TERMS": {
    "title": "Nutzungsbedingungen",
    "link": "Nutzungsbedingungen",
    "caption": "Erfahren Sie mehr über die Bedingungen für die Nutzung unserer Dienste und die Regeln auf dieser Website.",
    "metadata": {
      "title": "Nutzungsbedingungen – Hello Software",
      "description": "Lesen Sie die Nutzungsbedingungen von Hello Software, um mehr über die Regeln zur Nutzung unserer digitalen Dienstleistungen zu erfahren."
    },
    "rules": [
      {
        "title": "1. Definitionen",
        "content": "Dienstanbieter – JavaScript Solutions Igor Dudek, handelnd unter dem Namen Hello Software, USt-IdNr.: PL8943163760, Kontakt-E-Mail: contact@hello-software.com.\n\nNutzer – eine natürliche oder juristische Person, die Dienstleistungen des Dienstanbieters nutzt, z. B. die Entwicklung von Websites, mobilen Anwendungen, E-Commerce-Systemen und anderen IT-Lösungen."
      },
      {
        "title": "2. Leistungsumfang",
        "content": "Hello Software bietet umfassende IT-Dienstleistungen an, darunter:\n\n- Entwicklung moderner Websites,\n- Mobile Apps für Android und iOS,\n- E-Commerce-Lösungen inkl. Onlineshops,\n- Web- und Backend-Anwendungen,\n- API- und Systemintegrationen,\n- SEO-Optimierung, Cloud-Services und IT-Outsourcing."
      },
      {
        "title": "3. Nutzungsbedingungen",
        "content": "Die Dienstleistungen werden auf Grundlage eines mit dem Nutzer geschlossenen Vertrags erbracht.\n\nDer Nutzer verpflichtet sich, die Dienstleistungen gemäß geltendem Recht zu nutzen.\n\nDer Dienstanbieter behält sich das Recht vor, das Dienstleistungsangebot jederzeit zu ändern."
      },
      {
        "title": "4. Zahlungen",
        "content": "Die Vergütung wird individuell im Rahmen des geschlossenen Vertrags vereinbart."
      },
      {
        "title": "5. Reklamationen",
        "content": "Reklamationen im Zusammenhang mit den erbrachten Dienstleistungen sind an folgende E-Mail-Adresse zu richten: contact@hello-software.com."
      },
      {
        "title": "6. Haftung",
        "content": "Der Dienstanbieter haftet nicht für Schäden, die durch unsachgemäße Nutzung der Dienste oder durch höhere Gewalt entstehen."
      },
      {
        "title": "7. Vertragsauflösung",
        "content": "Der Vertrag kann im gegenseitigen Einvernehmen oder gemäß den im Vertrag festgelegten Bedingungen beendet werden."
      },
      {
        "title": "8. Änderungen der Nutzungsbedingungen",
        "content": "Der Dienstanbieter behält sich das Recht vor, die Nutzungsbedingungen zu ändern. Die Nutzer werden über Änderungen informiert."
      },
      {
        "title": "9. Geistiges Eigentum",
        "content": "Sofern nicht anders vereinbart, verbleiben alle Rechte am geistigen Eigentum an entwickelter Software, Websites oder Systemen bis zur vollständigen Bezahlung bei Hello Software."
      },
      {
        "title": "10. Service Level Agreement (SLA)",
        "content": "Der Unterstützungsgrad und die Reaktionszeiten werden individuell vereinbart. Die Standard-SLA sieht eine E-Mail-Antwort innerhalb von 48 Stunden an Werktagen vor."
      },
      {
        "title": "11. Tests und Abnahme",
        "content": "Vor der endgültigen Übergabe wird die Software von beiden Parteien getestet. Der Nutzer verpflichtet sich, eventuelle Mängel innerhalb von 14 Tagen zu melden."
      },
      {
        "title": "12. Technischer Support",
        "content": "Support nach dem Projektstart wird im Rahmen eines separaten Supportvertrags oder auf Grundlage der vereinbarten Wartungsbedingungen bereitgestellt."
      }
    ]
  },
  "POLICY": {
    "title": "Datenschutzrichtlinie",
    "link": "Datenschutzrichtlinie",
    "caption": "Erfahren Sie, wie wir Ihre Privatsphäre schützen und personenbezogene Daten verarbeiten.",
    "metadata": {
      "title": "Datenschutzrichtlinie – Hello Software",
      "description": "Erfahren Sie, wie Hello Software Ihre personenbezogenen Daten gemäß der DSGVO verarbeitet und schützt."
    },
    "rules": [
      {
        "title": "1. Verantwortlicher für personenbezogene Daten",
        "content": "Verantwortlicher ist JavaScript Solutions Igor Dudek, handelnd unter dem Namen Hello Software, USt-IdNr.: PL8943163760, Kontakt-E-Mail: contact@hello-software.com."
      },
      {
        "title": "2. Zwecke der Datenverarbeitung",
        "content": "Wir verarbeiten personenbezogene Daten zur Erbringung von IT-Dienstleistungen, einschließlich der Entwicklung von Websites, mobilen Apps, E-Commerce-Systemen, APIs und Integrationen sowie zu Marketingzwecken mit Einwilligung des Nutzers."
      },
      {
        "title": "3. Rechtsgrundlage der Verarbeitung",
        "content": "Die Verarbeitung erfolgt auf Grundlage der Einwilligung des Nutzers, zur Vertragserfüllung sowie aufgrund berechtigter Interessen des Verantwortlichen."
      },
      {
        "title": "4. Umfang der verarbeiteten Daten",
        "content": "Wir erfassen Daten wie Name, E-Mail-Adresse (wenn freiwillig angegeben) sowie analytische Daten zur Nutzung der Website (Google Analytics)."
      },
      {
        "title": "5. Empfänger der Daten",
        "content": "Daten können an technische Dienstleister, Hosting-Anbieter, Webanalyse-Firmen (z. B. Google Analytics) und externe Partner im Rahmen der Vertragserfüllung weitergegeben werden."
      },
      {
        "title": "6. Datenübermittlung außerhalb des EWR",
        "content": "Daten können an Länder außerhalb des EWR übermittelt werden, insbesondere an Google (USA) im Rahmen von Google Analytics. Google gewährleistet einen angemessenen Datenschutz."
      },
      {
        "title": "7. Rechte der Nutzer",
        "content": "Der Nutzer hat das Recht auf Auskunft, Berichtigung, Löschung, Datenübertragbarkeit und Einschränkung der Verarbeitung. Die Einwilligung kann jederzeit durch Kontaktaufnahme mit dem Verantwortlichen widerrufen werden."
      },
      {
        "title": "8. Kontakt bei Datenschutzfragen",
        "content": "Zur Ausübung Ihrer Rechte wenden Sie sich bitte per E-Mail an: contact@hello-software.com."
      },
      {
        "title": "9. Speicherfrist",
        "content": "Personenbezogene Daten werden für die Dauer des Vertrags und für den gesetzlich vorgeschriebenen Zeitraum gespeichert, abhängig von der Art der Daten."
      }
    ]
  },
  "COOKIES": {
    "title": "Cookie-Richtlinie",
    "link": "Cookies",
    "caption": "Erfahren Sie, wie wir Cookies verwenden, um unsere Website zu verbessern.",
    "metadata": {
      "title": "Cookie-Richtlinie – Hello Software",
      "description": "Erfahren Sie, wie Hello Software Cookies zur Verbesserung der Funktionalität und zur Analyse des Datenverkehrs verwendet."
    },
    "rules": [
      {
        "title": "1. Was sind Cookies?",
        "content": "Cookies sind kleine Textdateien, die auf dem Gerät des Nutzers gespeichert werden und die Identifizierung des Geräts sowie das Speichern von Sitzungsinformationen ermöglichen."
      },
      {
        "title": "2. Arten von Cookies",
        "content": "Notwendige Cookies – ermöglichen grundlegende Funktionen der Website, wie Sicherheit und Zugang zu Diensten (z. B. functionality_storage, security_storage).\n\nAnalyse-Cookies – erfassen anonyme Daten über die Nutzung der Website, z. B. Google Analytics.\n\nMarketing- und Werbe-Cookies – ermöglichen die Anzeige personalisierter Werbung.\n\nPersonalisierungs-Cookies – passen Inhalte der Website an Benutzerpräferenzen an."
      },
      {
        "title": "3. Rechtsgrundlage und DSGVO/ePrivacy-Konformität",
        "content": "Gemäß DSGVO und der ePrivacy-Richtlinie werden notwendige Cookies ohne Zustimmung des Nutzers gesetzt. Alle anderen Cookies (z. B. Analyse, Marketing) erfordern eine vorherige Zustimmung, die jederzeit widerrufen werden kann."
      },
      {
        "title": "4. Zweck der Cookie-Nutzung",
        "content": "Cookies dienen der Verbesserung der Website-Funktionalität, der Sicherheit, der Analyse des Datenverkehrs und der Anpassung von Inhalten an Nutzerbedürfnisse. Insbesondere verwenden wir Google Analytics zur Überwachung der Website-Nutzung."
      },
      {
        "title": "5. Zustimmung zu Cookies",
        "content": "Beim ersten Besuch der Website wird ein Cookie-Banner angezeigt, über den der Nutzer der Verwendung bestimmter Cookie-Kategorien zustimmen kann. Diese Zustimmung kann jederzeit widerrufen werden."
      },
      {
        "title": "6. Verwaltung von Cookies",
        "content": "Der Nutzer kann die Cookie-Einstellungen jederzeit im Browser ändern. Anleitungen finden sich in der Dokumentation des jeweiligen Browsers. Die Zustimmung kann auch über das Cookie-Banner auf der Website verwaltet werden."
      },
      {
        "title": "7. Google Analytics",
        "content": "Wir verwenden Google Analytics zur Analyse des Website-Traffics. Die Daten werden anonym erfasst. Weitere Informationen finden Sie in der Datenschutzerklärung von Google: https://policies.google.com/privacy"
      }
    ]
  },
  "FOOTER": {
    "heading": "Möchten Sie, dass wir Sie kontaktieren?<br></br>Hinterlassen Sie unten Ihre E-Mail-Adresse",
    "caption": "Hello Software bietet innovative, benutzerfreundliche Softwarelösungen zur Optimierung Ihrer Geschäftsprozesse. Mit Fokus auf Effizienz, Skalierbarkeit und einfacher Bedienung helfen wir Ihrem Team, produktiver zu arbeiten und zu wachsen.",
    "form": {
      "email": {
        "placeholder": "E-Mail-Adresse *"
      },
      "error": {
        "general": "Ein Fehler ist aufgetreten. Bitte versuchen Sie es später noch einmal.",
        "email": "Bitte geben Sie eine gültige E-Mail-Adresse ein"
      },
      "success": "Ihre Nachricht wurde erfolgreich gesendet. Wir melden uns in Kürze bei Ihnen!",
      "button": {
        "default": "Kontakt",
        "sending": "Wird gesendet..."
      }
    },
    "all-rights-reserved": "© Hello Software 2025. Alle Rechte vorbehalten.",
    "STATS_SECTION": [
      { "title": "5+", "caption": "Jahre Erfahrung" },
      { "title": "Weltweit", "caption": "Aus Polen, weltweit verfügbar" },
      { "title": "+100%", "caption": "Wachstum seit dem Start" }
    ]
  },
  "COOKIES_BANNER": {
    "title": "Cookies",
    "link": "Cookie-Richtlinie",
    "caption": "Wir verwenden Cookies, um die ordnungsgemäße Funktion der Website zu gewährleisten, den Datenverkehr zu analysieren und personalisierte Werbung anzuzeigen. Sie können Ihre Einwilligungen verwalten oder alle akzeptieren, um die volle Funktionalität der Website zu nutzen. Ihre Daten werden gemäß der DSGVO verarbeitet und ausschließlich für festgelegte Zwecke verwendet.",
    "preferences": {
      "ad_storage": "Werbe-Cookies – ermöglichen das Speichern von Daten im Zusammenhang mit Werbung, um personalisierte Inhalte basierend auf den Interessen des Nutzers anzuzeigen.",
      "analytics_storage": "Analyse-Cookies – ermöglichen das Sammeln von Daten wie besuchte Seiten und Verweildauer, um die Benutzererfahrung zu optimieren.",
      "personalization_storage": "Personalisierungs-Cookies – speichern Benutzereinstellungen, um bei zukünftigen Besuchen eine personalisierte Navigation zu ermöglichen.",
      "ad_user_data": "Nutzerdaten-Cookies – ermöglichen die Übermittlung anonymer Nutzerdaten an Werbesysteme wie Google Ads zur besseren Zielgruppenansprache.",
      "ad_personalization": "Marketing-Cookies – unterstützen die Personalisierung von Werbeinhalten basierend auf dem Nutzerverhalten, um die Relevanz der Werbung zu steigern."
    },
    "button": {
      "settings": {
        "open": "Cookie-Einstellungen",
        "close": "Einstellungen schließen"
      },
      "reject": "Alle ablehnen",
      "submit": {
        "custom": "Auswahl akzeptieren",
        "acceptAll": "Alle akzeptieren"
      }
    }
  }
}
