{
  "HOME_PAGE": {
    "title": "Hello Software – Modern Web & Mobile App Development",
    "link": "Home Page",
    "caption": "Digital products that scale with your business – websites, mobile apps, and cloud software.",
    "metadata": {
      "title": "Hello Software – Modern Web & Mobile App Development",
      "description": "Software House dealing with the creation of websites, mobile and web applications and provide complete technology support for your business."
    },
    "HERO_SECTION": {
      "text": "We’re an experienced software house delivering high-performance digital solutions tailored to your business needs. We create fast, modern websites, mobile applications for iOS & Android, and scalable e-commerce platforms – all optimized for performance and SEO. Looking for a reliable technology partner? Let’s build your next digital product together – get in touch with us today!",
      "button": "Contact with us"
    },
    "SERVICES_SECTION": {},
    "HOW_IT_WORK_SECTION": {
      "title": "Our Development Process",
      "caption": "Discover each stage of our development workflow – from strategy and design to launch and optimization.We simplify complex processes to deliver efficient, scalable, and user-friendly software solutions.",
      "steps": [
        {
          "title": "Strategy & UX Design",
          "description": "Define the business goals, target audience, and key functionalities. Create wireframes and high-fidelity mockups to ensure an intuitive user experience and conversion-driven layout."
        },
        {
          "title": "Front-End & Back-End Development",
          "description": "Transform the approved designs into a fast, responsive website using modern technologies like React and relevant frameworks. Implement scalable back-end architecture as needed."
        },
        {
          "title": "Quality Assurance & Launch",
          "description": "Perform thorough testing for performance, responsiveness, SEO readiness, and security. Fix bugs, optimize loading speed, and deploy the website on a reliable server with analytics integration."
        }
      ]
    }
  },
  "SERVICES": {
    "title": "Our Services – Web & App Development",
    "link": "Services",
    "caption": "Explore our full range of software development services tailored to your business needs.",
    "metadata": {
      "title": "IT Services – Hello Software",
      "description": "We offer comprehensive IT services: websites, mobile apps, API integrations, and cloud solutions."
    },
    "section": {
      "title": "Innovative Services We're Offering",
      "motto": "Transform Your Business Idea Into Powerful Software"
    }
  },
  "WEBSITES": {
    "title": "Website Development",
    "link": "Websites",
    "button": { "read_more": "Read More" },
    "caption": "Custom website design and development – fast, modern, and optimized for SEO.",
    "metadata": {
      "title": "Websites – Hello Software",
      "description": "We design fast, modern websites optimized for SEO and user experience."
    }
  },
  "E_COMMERCE": {
    "title": "E-Commerce Solutions",
    "link": "E-Commerce",
    "button": { "read_more": "Read More" },
    "caption": "Scalable and secure e-commerce solutions – tailored for high conversions and growth.",
    "metadata": {
      "title": "E-Commerce – Hello Software",
      "description": "We create scalable and secure e-commerce stores focused on conversions and performance."
    }
  },
  "WEB_APPLICATIONS": {
    "title": "Web Application Development",
    "link": "Web Applications",
    "button": { "read_more": "Read More" },
    "caption": "Powerful and scalable web applications – crafted with cutting-edge technologies.",
    "metadata": {
      "title": "Web Applications – Hello Software",
      "description": "We develop powerful and scalable web applications tailored to your business needs."
    }
  },
  "MOBILE_APPLICATIONS": {
    "title": "Mobile App Development",
    "link": "Mobile Applications",
    "button": { "read_more": "Read More" },
    "caption": "Developing Android & iOS mobile apps – seamless, high-performance, and user-friendly.",
    "metadata": {
      "title": "Mobile Applications – Hello Software",
      "description": "We build mobile apps for Android and iOS – fast, intuitive, and modern."
    }
  },
  "SERVER_APPLICATIONS": {
    "title": "API & System Integrations",
    "link": "API and System Integrations",
    "button": { "read_more": "Read More" },
    "caption": "Seamless API development and system integration – enhancing connectivity and automation.",
    "metadata": {
      "title": "API & System Integrations – Hello Software",
      "description": "We develop API integrations and systems that streamline automation and app communication."
    }
  },
  "SEARCH_ENGINE_OPTIMIZATION": {
    "title": "SEO Optimization",
    "link": "Search Engine Optimization (SEO)",
    "button": { "read_more": "Read More" },
    "caption": "Boost your online visibility with expert SEO – higher rankings, more traffic, better conversions.",
    "metadata": {
      "title": "Search Engine Optimization (SEO) – Hello Software",
      "description": "Boost your online visibility with effective SEO. More traffic, more customers."
    }
  },
  "CLOUD_COMPUTING_SOLUTIONS": {
    "title": "Cloud Solutions",
    "link": "Cloud Computing Solutions",
    "button": { "read_more": "Read More" },
    "caption": "Cloud-based solutions for businesses – secure, scalable, and optimized for performance.",
    "metadata": {
      "title": "Cloud Computing Solutions – Hello Software",
      "description": "Secure, scalable, and modern cloud-based solutions for your business."
    }
  },
  "OUTSOURCING": {
    "title": "IT Outsourcing Services",
    "link": "Outsourcing IT",
    "button": { "read_more": "Read More" },
    "caption": "Reliable IT outsourcing services – cost-effective, expert-driven, and scalable solutions.",
    "metadata": {
      "title": "IT Outsourcing – Hello Software",
      "description": "External development teams – flexible, cost-effective, and professional."
    }
  },
  "TECHNOLOGIES": {
    "title": "Technologies We Use",
    "link": "Technologies",
    "caption": "Explore modern technologies we use – from React and Node.js to cloud infrastructure.",
    "metadata": {
      "title": "Technologies – Hello Software",
      "description": "Discover the technologies we use to build modern digital solutions – React, Node.js, TypeScript, and more."
    }
  },
  "TYPESCRIPT": {
    "title": "TypeScript Development",
    "link": "TypeScript",
    "caption": "Scalable front-end and back-end apps written in TypeScript for high performance and safety.",
    "metadata": {
      "title": "Technology TypeScript – Hello Software",
      "description": "We use TypeScript for modern, type-safe application development across frontend and backend."
    }
  },
  "REACT": {
    "title": "React Development",
    "link": "React",
    "caption": "Interactive and dynamic user interfaces powered by React – responsive and fast.",
    "metadata": {
      "title": "Technology React – Hello Software",
      "description": "We develop modern UIs using React – fast, scalable, and SEO-friendly interfaces."
    }
  },
  "NODE_JS": {
    "title": "Node.js Development",
    "link": "Node.js",
    "caption": "Robust backend services and APIs built with Node.js – scalable and real-time ready.",
    "metadata": {
      "title": "Technology Node.js – Hello Software",
      "description": "We use Node.js to build fast and scalable backend systems and APIs."
    }
  },
  "REACT_NATIVE": {
    "title": "React Native Development",
    "link": "React Native",
    "caption": "Cross-platform mobile apps with React Native – fast development and great performance.",
    "metadata": {
      "title": "Technology React Native – Hello Software",
      "description": "We develop cross-platform mobile apps using React Native – fast, native-like experience."
    }
  },
  "COMPANY": {
    "title": "About Hello Software",
    "link": "About Us",
    "caption": "Learn more about Hello Software – our team, mission, and commitment to innovation.",
    "metadata": {
      "title": "About Us – Hello Software",
      "description": "Meet the team behind Hello Software – experts in web, mobile, and cloud development."
    }
  },
  "CONTACT": {
    "title": "Contact Hello Software",
    "link": "Contact",
    "caption": "Have a project in mind? Get in touch with Hello Software – we're ready to help.",
    "metadata": {
      "title": "Contact – Hello Software",
      "description": "Get in touch with our team to discuss your project or request a free consultation."
    }
  },
  "SUPPORT": {
    "title": "Helpful Links",
    "link": "Helpful Links",
    "caption": "Access useful resources, documentation, and policies related to our services.",
    "metadata": {
      "title": "Helpful Links – Hello Software",
      "description": "Explore helpful links and important resources from Hello Software to stay informed and supported."
    }
  },
  "TERMS": {
    "title": "Hello Software Terms & Conditions",
    "link": "Terms & Conditions",
    "caption": "Understand the legal terms that govern your use of our services and website.",
    "metadata": {
      "title": "Terms & Conditions – Hello Software",
      "description": "Read the terms and conditions of Hello Software to learn about your rights and responsibilities when using our services."
    }
  },
  "POLICY": {
    "title": "Hello Software Privacy Policy",
    "link": "Privacy Policy",
    "caption": "Learn how we handle your data and protect your privacy across all digital services.",
    "metadata": {
      "title": "Privacy Policy – Hello Software",
      "description": "Discover how Hello Software collects, uses, and protects your personal data in our privacy policy."
    }
  },
  "COOKIES": {
    "title": "Cookies Policy",
    "link": "Cookies",
    "caption": "Find out how we use cookies to improve your experience on our website.",
    "metadata": {
      "title": "Cookies Policy – Hello Software",
      "description": "Understand how Hello Software uses cookies for better functionality, analytics, and user experience."
    }
  },
  "FOOTER": {
    "heading": "Would you like us to contact with you? <br></br> Leave your email below",
    "link": "To Page Down",
    "caption": "Hello Software provides innovative, user-centric software solutions designed to streamline your business processes. With a focus on efficiency, scalability, and ease of use, we offer cutting-edge tools that  empower your team to achieve greater productivity and growth.",
    "form": {
      "placeholder": "your-email@example.com",
      "button": "Contact"
    },
    "all-rights-reserved": "© Hello Software 2025. All rights reserved."
  }
}
