{
  "HOME_PAGE": {
    "title": "Hello Software – Modern Web & Mobile App Development",
    "link": "Home Page",
    "caption": "Digital products that scale with your business – websites, mobile apps, and cloud software.",
    "metadata": {
      "title": "Hello Software – Modern Web & Mobile App Development",
      "description": "Software House dealing with the creation of websites, mobile and web applications and provide complete technology support for your business."
    },
    "HERO_SECTION": {
      "text": "We’re an experienced software house delivering high-performance digital solutions tailored to your business needs. We create fast, modern websites, mobile applications for iOS & Android, and scalable e-commerce platforms – all optimized for performance and SEO. Looking for a reliable technology partner? Let’s build your next digital product together – get in touch with us today!",
      "button": "Contact with us"
    },
    "SERVICES_SECTION": {},
    "HOW_IT_WORK_SECTION": {
      "title": "Our Development Process",
      "caption": "Discover each stage of our development workflow – from strategy and design to launch and optimization.We simplify complex processes to deliver efficient, scalable, and user-friendly software solutions.",
      "steps": [
        {
          "title": "Strategy & UX Design",
          "description": "Define the business goals, target audience, and key functionalities. Create wireframes and high-fidelity mockups to ensure an intuitive user experience and conversion-driven layout."
        },
        {
          "title": "Front-End & Back-End Development",
          "description": "Transform the approved designs into a fast, responsive website using modern technologies like React and relevant frameworks. Implement scalable back-end architecture as needed."
        },
        {
          "title": "Quality Assurance & Launch",
          "description": "Perform thorough testing for performance, responsiveness, SEO readiness, and security. Fix bugs, optimize loading speed, and deploy the website on a reliable server with analytics integration."
        }
      ]
    },
    "CONNTACT_SECTION": {
      "form": {
        "title": "Need a website or mobile app?",
        "caption": "Drop us a message",
        "input": {
          "email": {
            "placeholder": "Email address *",
            "error": "Please enter a valid email address"
          },
          "name": {
            "placeholder": "Name",
            "error": "Please enter a valid name"
          },
          "phone": {
            "placeholder": "Phone number",
            "error": "Please enter a valid phone number"
          },
          "message": {
            "placeholder": "Tell us about your project *",
            "error": "Your message should contain at least 10 characters"
          }
        },
        "submit": "Send Message",
        "sending": "Sending...",
        "success": "Message sent successfully. We'll get back to you soon!",
        "error": "Something went wrong. Please try again later."
      },
      "informations": {
        "title": "Contact Information",
        "caption": "Reach out to us – we’ll guide you, suggest solutions, and provide a quote for your IT project",
        "location": {
          "title": "Our Location",
          "detail": "Wrocław, Poland"
        },
        "mail": {
          "title": "Email us",
          "detail": "contact@hello-software.com"
        }
      }
    },
    "STATS_SECTION": [
      { "title": "5+", "caption": "Years of experience" },
      { "title": "Worldwide", "caption": "From Poland, available worldwide" },
      { "title": "+100%", "caption": "Growth from the beginning" }
    ]
  },
  "SERVICES": {
    "title": "Our Services – Web & App Development",
    "link": "Services",
    "caption": "Explore our full range of software development services tailored to your business needs",
    "motto": "Transform Your Business Idea Into Powerful Software",
    "metadata": {
      "title": "IT Services – Hello Software",
      "description": "We offer comprehensive IT services: websites, mobile apps, API integrations, and cloud solutions."
    },
    "section": {
      "title": "Innovative Services We're Offering",
      "motto": "Transform Your Business Idea Into Powerful Software"
    },
    "STATS_SECTION": [
      { "title": "5+", "caption": "Years of experience" },
      { "title": "Worldwide", "caption": "From Poland, available worldwide" },
      { "title": "+100%", "caption": "Growth from the beginning" }
    ]
  },
  "WEBSITES": {
    "title": "Website Development",
    "link": "Websites",
    "button": { "read_more": "Read More" },
    "caption": "Custom website design and development – fast, modern, and optimized for SEO.",
    "metadata": {
      "title": "Websites – Hello Software",
      "description": "We design fast, modern websites optimized for SEO and user experience."
    }
  },
  "E_COMMERCE": {
    "title": "E-Commerce Solutions",
    "link": "E-Commerce",
    "button": { "read_more": "Read More" },
    "caption": "Scalable and secure e-commerce solutions – tailored for high conversions and growth.",
    "metadata": {
      "title": "E-Commerce – Hello Software",
      "description": "We create scalable and secure e-commerce stores focused on conversions and performance."
    }
  },
  "WEB_APPLICATIONS": {
    "title": "Web Application Development",
    "link": "Web Applications",
    "button": { "read_more": "Read More" },
    "caption": "Powerful and scalable web applications – crafted with cutting-edge technologies.",
    "metadata": {
      "title": "Web Applications – Hello Software",
      "description": "We develop powerful and scalable web applications tailored to your business needs."
    }
  },
  "MOBILE_APPLICATIONS": {
    "title": "Mobile App Development",
    "link": "Mobile Applications",
    "button": { "read_more": "Read More" },
    "caption": "Developing Android & iOS mobile apps – seamless, high-performance, and user-friendly.",
    "metadata": {
      "title": "Mobile Applications – Hello Software",
      "description": "We build mobile apps for Android and iOS – fast, intuitive, and modern."
    }
  },
  "SERVER_APPLICATIONS": {
    "title": "API & System Integrations",
    "link": "API and System Integrations",
    "button": { "read_more": "Read More" },
    "caption": "Seamless API development and system integration – enhancing connectivity and automation.",
    "metadata": {
      "title": "API & System Integrations – Hello Software",
      "description": "We develop API integrations and systems that streamline automation and app communication."
    }
  },
  "SEARCH_ENGINE_OPTIMIZATION": {
    "title": "SEO Optimization",
    "link": "Search Engine Optimization (SEO)",
    "button": { "read_more": "Read More" },
    "caption": "Boost your online visibility with expert SEO – higher rankings, more traffic, better conversions.",
    "metadata": {
      "title": "Search Engine Optimization (SEO) – Hello Software",
      "description": "Boost your online visibility with effective SEO. More traffic, more customers."
    }
  },
  "CLOUD_COMPUTING_SOLUTIONS": {
    "title": "Cloud Solutions",
    "link": "Cloud Computing Solutions",
    "button": { "read_more": "Read More" },
    "caption": "Cloud-based solutions for businesses – secure, scalable, and optimized for performance.",
    "metadata": {
      "title": "Cloud Computing Solutions – Hello Software",
      "description": "Secure, scalable, and modern cloud-based solutions for your business."
    }
  },
  "OUTSOURCING": {
    "title": "IT Outsourcing Services",
    "link": "Outsourcing IT",
    "button": { "read_more": "Read More" },
    "caption": "Reliable IT outsourcing services – cost-effective, expert-driven, and scalable solutions.",
    "metadata": {
      "title": "IT Outsourcing – Hello Software",
      "description": "External development teams – flexible, cost-effective, and professional."
    }
  },
  "TECHNOLOGIES": {
    "title": "Technologies We Use",
    "link": "Technologies",
    "caption": "Discover cutting-edge technologies we use to build modern websites and apps.",
    "metadata": {
      "title": "Technologies – Hello Software",
      "description": "Discover the technologies we use to build modern digital solutions – React, Node.js, TypeScript, and more."
    }
  },
  "TYPESCRIPT": {
    "title": "TypeScript Development",
    "link": "TypeScript",
    "caption": "Scalable front-end and back-end apps written in TypeScript for high performance and safety.",
    "metadata": {
      "title": "Technology TypeScript – Hello Software",
      "description": "We use TypeScript for modern, type-safe application development across frontend and backend."
    }
  },
  "REACT": {
    "title": "React Development",
    "link": "React",
    "caption": "Interactive and dynamic user interfaces powered by React – responsive and fast.",
    "metadata": {
      "title": "Technology React – Hello Software",
      "description": "We develop modern UIs using React – fast, scalable, and SEO-friendly interfaces."
    }
  },
  "NODE_JS": {
    "title": "Node.js Development",
    "link": "Node.js",
    "caption": "Robust backend services and APIs built with Node.js – scalable and real-time ready.",
    "metadata": {
      "title": "Technology Node.js – Hello Software",
      "description": "We use Node.js to build fast and scalable backend systems and APIs."
    }
  },
  "REACT_NATIVE": {
    "title": "React Native Development",
    "link": "React Native",
    "caption": "Cross-platform mobile apps with React Native – fast development and great performance.",
    "metadata": {
      "title": "Technology React Native – Hello Software",
      "description": "We develop cross-platform mobile apps using React Native – fast, native-like experience."
    }
  },
  "ABOUT_US": {
    "title": "About Hello Software",
    "link": "About Us",
    "caption": "Learn more about Hello Software – our team, mission, and commitment to innovation.",
    "metadata": {
      "title": "About Us – Hello Software",
      "description": "Meet the team behind Hello Software – experts in web, mobile, and cloud development."
    },
    "sections_1": {
      "title": "Our Core Values",
      "caption": "The foundation behind every successful project we deliver.",
      "text": "At Hello Software, we are guided by values such as transparency, innovation, accountability, and commitment. We believe that only through honest, collaborative partnerships can we deliver top-quality software solutions that truly support the growth of our clients' businesses."
    },
    "sections_2": {
      "title": "Our Team Culture",
      "caption": "Driven by passion, built on trust and mutual respect.",
      "text": "We foster a work environment focused on teamwork, open communication, and continuous learning. Every team member at Hello Software has a real impact on both projects and the company. We promote a culture of feedback, flexibility, and work-life balance that fuels productivity and creativity."
    },
    "sections_3": {
      "title": "Our Vision",
      "caption": "Modern technologies serving people and business growth.",
      "text": "Our vision is to create intelligent, scalable, and accessible software solutions that meet the evolving needs of today’s digital world. We strive to be a trusted tech partner for businesses worldwide, enabling their digital transformation and helping them achieve their goals."
    },
    "sections_4": {
      "title": "Why Choose Us?",
      "caption": "Your business goals in the hands of a skilled software team.",
      "text": "Choosing Hello Software means partnering with a team that understands your needs and translates them into effective technology solutions. We combine experience, innovation, and transparency in everything we do. Each project is built on strategic analysis, a tailored plan, and the highest quality standards—from concept to deployment and beyond."
    }
  },
  "CONTACT": {
    "title": "Contact Hello Software",
    "link": "Contact",
    "caption": "Do you need a website, mobile app, or e-commerce solution? Get in touch with our team of IT experts to discuss your project.",
    "metadata": {
      "title": "Contact Hello Software – Expert IT Services",
      "description": "Have an idea for a digital product? Contact Hello Software and get a free consultation for your website, mobile app, or custom software project."
    },
    "CONNTACT_SECTION": {
      "form": {
        "title": "Need a website or mobile app?",
        "caption": "Drop us a message",
        "input": {
          "email": {
            "placeholder": "Email address *",
            "error": "Please enter a valid email address"
          },
          "name": {
            "placeholder": "Name",
            "error": "Please enter a valid name"
          },
          "phone": {
            "placeholder": "Phone number",
            "error": "Please enter a valid phone number"
          },
          "message": {
            "placeholder": "Tell us about your project *",
            "error": "Your message should contain at least 10 characters"
          }
        },
        "submit": "Send Message",
        "sending": "Sending...",
        "success": "Message sent successfully. We'll get back to you soon!",
        "error": "Something went wrong. Please try again later."
      },
      "informations": {
        "title": "Contact Information",
        "caption": "Reach out to us – we’ll guide you, suggest solutions, and provide a quote for your IT project",
        "location": {
          "title": "Our Location",
          "detail": "Wrocław, Poland"
        },
        "mail": {
          "title": "Email us",
          "detail": "contact@hello-software.com"
        }
      }
    }
  },
  "SUPPORT": {
    "title": "Helpful Links",
    "link": "Helpful Links",
    "caption": "Access useful resources, documentation, and policies related to our services.",
    "metadata": {
      "title": "Helpful Links – Hello Software",
      "description": "Explore helpful links and important resources from Hello Software to stay informed and supported."
    }
  },
  "TERMS": {
    "title": "Terms of Service",
    "link": "Terms of Service",
    "caption": "Learn the conditions for using our services and the rules governing this website.",
    "metadata": {
      "title": "Terms of Service – Hello Software",
      "description": "Read the terms of Hello Software to learn more about the rules for using our digital services."
    },
    "rules": [
      {
        "title": "1. Definitions",
        "content": "Service Provider – JavaScript Solutions Igor Dudek, operating under the name Hello Software, VAT ID: PL8943163760, contact email: contact@hello-software.com.\n\nUser – an individual or entity using services provided by the Service Provider, such as website development, mobile applications, e-commerce systems, and other IT solutions."
      },
      {
        "title": "2. Scope of Services",
        "content": "Hello Software provides comprehensive IT services, including:\n\n- Modern website development,\n- Mobile apps for Android and iOS,\n- E-commerce solutions including online stores,\n- Web and backend applications,\n- API and system integrations,\n- SEO optimization, cloud services, and IT outsourcing."
      },
      {
        "title": "3. Terms of Service Usage",
        "content": "Services are provided based on a contract signed with the User.\n\nThe User agrees to use the services in compliance with applicable laws.\n\nThe Service Provider reserves the right to modify the service offering at any time."
      },
      {
        "title": "4. Payments",
        "content": "Fees for services are agreed upon individually within the scope of the signed contracts."
      },
      {
        "title": "5. Complaints",
        "content": "Complaints regarding provided services should be submitted to: contact@hello-software.com."
      },
      {
        "title": "6. Liability",
        "content": "The Service Provider shall not be liable for damages resulting from improper use of the services, or for delays caused by force majeure."
      },
      {
        "title": "7. Termination",
        "content": "The contract may be terminated by mutual agreement or under conditions specified in the contract."
      },
      {
        "title": "8. Amendments to the Terms",
        "content": "The Service Provider reserves the right to amend the Terms. Users will be notified of changes."
      },
      {
        "title": "9. Intellectual Property",
        "content": "Unless otherwise agreed, all intellectual property rights to the developed software, websites, or systems remain with Hello Software until full payment is made."
      },
      {
        "title": "10. Service Level Agreement (SLA)",
        "content": "The level of support and response times are defined in individual agreements. Standard SLA includes email response within 48 hours on working days."
      },
      {
        "title": "11. Testing and Acceptance",
        "content": "Before final delivery, the software undergoes testing by both parties. The User is obliged to report any issues within 14 days of delivery."
      },
      {
        "title": "12. Technical Support",
        "content": "Post-launch support is available under a separate support agreement or based on the agreed maintenance terms."
      }
    ]
  },
  "POLICY": {
    "title": "Privacy Policy",
    "link": "Privacy Policy",
    "caption": "Learn how we protect your privacy and process personal data.",
    "metadata": {
      "title": "Privacy Policy – Hello Software",
      "description": "See how Hello Software processes and protects your personal data in accordance with GDPR regulations."
    },
    "rules": [
      {
        "title": "1. Data Controller",
        "content": "The data controller is JavaScript Solutions Igor Dudek, operating under the name Hello Software, VAT ID 8943163760, contact email: contact@hello-software.com."
      },
      {
        "title": "2. Purposes of Data Processing",
        "content": "We process personal data to provide IT services, including website and mobile app development, e-commerce systems, APIs and integrations, as well as for marketing purposes if the user gives consent."
      },
      {
        "title": "3. Legal Basis for Processing",
        "content": "Personal data is processed on the basis of user consent, contract execution, and the legitimate interests of the controller."
      },
      {
        "title": "4. Scope of Data Processed",
        "content": "We collect data such as name, email address (if voluntarily provided), and analytical data about website usage (Google Analytics)."
      },
      {
        "title": "5. Data Recipients",
        "content": "Data may be transferred to entities providing technical services, such as hosting providers, web analytics companies (e.g., Google Analytics), and external partners involved in contract execution."
      },
      {
        "title": "6. Transfer of Data Outside the EEA",
        "content": "Data may be transferred to countries outside the EEA, especially to Google (USA) when using Google Analytics. Google provides adequate data protection safeguards."
      },
      {
        "title": "7. User Rights",
        "content": "Users have the right to access, rectify, delete, transfer their data, and restrict processing. Consent can be withdrawn at any time by contacting the data controller."
      },
      {
        "title": "8. Contact Regarding Personal Data",
        "content": "To exercise your rights, contact the data controller at: contact@hello-software.com."
      },
      {
        "title": "9. Data Retention",
        "content": "Personal data is retained for the duration of the contract and for the period required by law, depending on the type of data."
      }
    ]
  },
  "COOKIES": {
    "title": "Cookie Policy",
    "link": "Cookies",
    "caption": "Learn how we use cookies to improve our website.",
    "metadata": {
      "title": "Cookie Policy – Hello Software",
      "description": "See how Hello Software uses cookies to improve website functionality and analyze traffic."
    },
    "rules": [
      {
        "title": "1. What Are Cookies",
        "content": "Cookies are small text files stored on the user's device that enable the identification of the device and save session information."
      },
      {
        "title": "2. Types of Cookies",
        "content": "Necessary cookies – enable the use of basic site functions, such as security and access to services (e.g., functionality_storage, security_storage).\n\nAnalytical cookies – collect anonymous data on website usage, e.g., Google Analytics.\n\nMarketing and advertising cookies – allow personalized ads to be displayed.\n\nPersonalization cookies – adapt website content to user preferences."
      },
      {
        "title": "3. Legal Basis and GDPR / ePrivacy Compliance",
        "content": "According to the GDPR and ePrivacy Directive, necessary cookies are used without user consent. All other cookies (e.g., analytical, marketing) require prior consent, which the user can give or withdraw at any time."
      },
      {
        "title": "4. Purpose of Using Cookies",
        "content": "Cookies are used to improve website functionality, ensure security, analyze traffic, and adapt content to user needs. In particular, we use Google Analytics to monitor website usage."
      },
      {
        "title": "5. Cookie Consent",
        "content": "A cookie banner is displayed during the user's first visit, allowing consent for specific cookie categories. This consent can be withdrawn at any time via cookie settings or the browser."
      },
      {
        "title": "6. Managing Cookies",
        "content": "Users can change cookie settings in their browser at any time. Instructions are available in browser documentation. Consent can also be managed via the website's cookie banner."
      },
      {
        "title": "7. Google Analytics",
        "content": "We use Google Analytics on our website to analyze traffic. Data is collected anonymously. Details are available in Google's privacy policy: https://policies.google.com/privacy"
      }
    ]
  },
  "FOOTER": {
    "title": "Would you like us to contact with you? <br></br> Leave your email below",
    "link": "To Page Down",
    "caption": "Hello Software provides innovative, user-centric software solutions designed to streamline your business processes. With a focus on efficiency, scalability, and ease of use, we offer cutting-edge tools that  empower your team to achieve greater productivity and growth.",
    "form": {
      "email": {
        "placeholder": "Email address *"
      },
      "error": {
        "general": "An error occurred. Please try again later.",
        "email": "Please enter a valid email address"
      },
      "success": "Your message has been sent. We'll get back to you shortly!",
      "button": {
        "default": "Contact",
        "sending": "Sending..."
      }
    },
    "all-rights-reserved": "© Hello Software 2025. All rights reserved.",
    "STATS_SECTION": [
      { "title": "5+", "caption": "Years of experience" },
      { "title": "Worldwide", "caption": "From Poland, available worldwide" },
      { "title": "+100%", "caption": "Growth from the beginning" }
    ]
  },
  "COOKIES_BANNER": {
    "title": "Cookies",
    "link": "Cookie Policy",
    "caption": "We use cookies to ensure the proper functioning of the website, analyze traffic, and display personalized ads. You can manage your preferences or accept all to use the full functionality of the site. Your data is processed in accordance with the GDPR and used solely for specified purposes.",
    "preferences": {
      "ad_storage": "Advertising cookies – enable storing data related to ads to display personalized content based on the user's interests.",
      "analytics_storage": "Analytics cookies – allow for collecting data like visited pages and time spent on the site, helping to optimize user experience.",
      "personalization_storage": "Personalization cookies – store user preferences to enable a personalized navigation experience during future visits.",
      "ad_user_data": "User data cookies – allow the transfer of anonymous user data to advertising systems like Google Ads to improve ad targeting.",
      "ad_personalization": "Marketing cookies – support the personalization of advertising content based on user behavior to increase ad relevance."
    },

    "button": {
      "settings": {
        "open": "Cookie Settings",
        "close": "Close Settings"
      },
      "reject": "Reject All",
      "submit": {
        "custom": "Accept Selected",
        "acceptAll": "Accept All"
      }
    }
  }
}
