{
  "HOME_PAGE": {
    "title": "Hello Software – Modern Web & Mobile App Development",
    "link": "Home Page",
    "caption": "Digital products that scale with your business – websites, mobile apps, and cloud software.",
    "metadata": {
      "title": "Hello Software – Modern Web & Mobile App Development",
      "description": "Software House dealing with the creation of websites, mobile and web applications and provide complete technology support for your business."
    },
    "HERO_SECTION": {
      "text": "We’re an experienced software house delivering high-performance digital solutions tailored to your business needs. We create fast, modern websites, mobile applications for iOS & Android, and scalable e-commerce platforms – all optimized for performance and SEO. Looking for a reliable technology partner? Let’s build your next digital product together – get in touch with us today!",
      "button": "Contact with us"
    },
    "HOW_IT_WORK_SECTION": {
      "title": "Our Development Process",
      "caption": "Discover each stage of our development workflow – from strategy and design to launch and optimization.We simplify complex processes to deliver efficient, scalable, and user-friendly software solutions.",
      "steps": [
        {
          "title": "Strategy & UX Design",
          "description": "Define the business goals, target audience, and key functionalities. Create wireframes and high-fidelity mockups to ensure an intuitive user experience and conversion-driven layout."
        },
        {
          "title": "Front-End & Back-End Development",
          "description": "Transform the approved designs into a fast, responsive website using modern technologies like React and relevant frameworks. Implement scalable back-end architecture as needed."
        },
        {
          "title": "Quality Assurance & Launch",
          "description": "Perform thorough testing for performance, responsiveness, SEO readiness, and security. Fix bugs, optimize loading speed, and deploy the website on a reliable server with analytics integration."
        }
      ]
    },
    "CONNTACT_SECTION": {
      "form": {
        "title": "Need a website or mobile app?",
        "caption": "Drop us a message",
        "input": {
          "email": {
            "placeholder": "Email address *",
            "error": "Please enter a valid email address"
          },
          "name": {
            "placeholder": "Name",
            "error": "Please enter a valid name"
          },
          "phone": {
            "placeholder": "Phone number",
            "error": "Please enter a valid phone number"
          },
          "message": {
            "placeholder": "Tell us about your project *",
            "error": "Your message should contain at least 10 characters"
          }
        },
        "submit": "Send Message",
        "sending": "Sending...",
        "success": "Message sent successfully. We'll get back to you soon!",
        "error": "Something went wrong. Please try again later."
      },
      "informations": {
        "title": "Contact Information",
        "caption": "Reach out to us – we’ll guide you, suggest solutions, and provide a quote for your IT project",
        "location": {
          "title": "Our Location",
          "detail": "Wrocław, Poland"
        },
        "mail": {
          "title": "Email us",
          "detail": "contact@hello-software.com"
        }
      }
    },
    "STATS_SECTION": [
      { "title": "5+", "caption": "Years of experience" },
      { "title": "Worldwide", "caption": "From Poland, available worldwide" },
      { "title": "+100%", "caption": "Growth from the beginning" }
    ]
  },
  "SERVICES": {
    "title": "Our Services – Web & App Development",
    "link": "Services",
    "caption": "Explore our full range of software development services tailored to your business needs",
    "motto": "Transform Your Business Idea Into Powerful Software",
    "metadata": {
      "title": "IT Services – Hello Software",
      "description": "We offer comprehensive IT services: websites, mobile apps, API integrations, and cloud solutions."
    },
    "section": {
      "title": "Innovative Services We're Offering",
      "motto": "Transform Your Business Idea Into Powerful Software"
    },
    "STATS_SECTION": [
      { "title": "5+", "caption": "Years of experience" },
      { "title": "Worldwide", "caption": "From Poland, available worldwide" },
      { "title": "+100%", "caption": "Growth from the beginning" }
    ]
  },
  "WEBSITES": {
    "title": "Websites",
    "link": "Websites",
    "button": { "read_more": "Read More" },
    "caption": "Modern websites – fast, responsive, and SEO-optimized.",
    "motto": "We build websites that drive your success",
    "metadata": {
      "title": "Websites – Hello Software",
      "description": "We design modern websites optimized for SEO and UX."
    },
    "text": "At Hello Software, we specialize in comprehensive website design and development that not only looks great but also delivers measurable business results. Whether you need a simple landing page, a complex corporate site, or an advanced CMS-based platform – we’re ready to create a solution tailored to your needs.\n\nEvery project starts with a detailed requirements analysis because we believe a successful website is built on a clear understanding of its purpose and audience. Our approach is fully customized – we don’t use pre-made templates. Instead, we design and develop every solution from scratch to match your industry, marketing strategy, and user expectations.\n\nWe create responsive, fast, and modern websites that meet the latest UX/UI and SEO standards. We ensure every website is optimized for search engines (SEO), increasing its visibility on Google and helping you attract more customers.\n\nAt Hello Software, we offer:\n- Design and development of modern websites\n- High-conversion landing pages\n- Advanced corporate websites and portfolios\n- CMS integrations\n- Custom content management panels\n- Full SEO and performance optimization\n- Ongoing support and post-launch development"
  },
  "E_COMMERCE": {
    "title": "Online Stores",
    "link": "E-Commerce",
    "button": { "read_more": "Read More" },
    "caption": "Secure and scalable online stores – maximize conversions.",
    "motto": "We build online stores that generate revenue",
    "metadata": {
      "title": "Online Stores – Hello Software",
      "description": "We create e-commerce stores focused on performance and conversion."
    },
    "text": "At Hello Software, we develop modern, scalable, and secure e-commerce stores.\nEach project is tailored to the specific needs of our clients – we don’t use pre-made templates, but instead design solutions customized to your business model, target audience, and sales goals.\n\nWe offer complete e-commerce implementations – from intuitive UX/UI design and payment/logistics integrations, to SEO optimization and sales analytics.\n\nWe build both small stores for startups and complex sales platforms with multiple integrations – including CRM, ERP, marketing tools, and marketplaces (e.g., Allegro, Amazon).\n\nOur e-commerce stores offer:\n– Fast and responsive performance on all mobile devices\n– High conversion rates thanks to refined UX and modern design\n– Integration with payment systems (Stripe, PayU, Przelewy24, Klarna, etc.)\n– Compliance with the latest SEO standards and Google Core Web Vitals\n– Full content control via an intuitive CMS\n– Customer data security and GDPR compliance\n\nGrow your store with a tech partner who knows e-commerce – choose Hello Software for results-driven solutions."
  },
  "WEB_APPLICATIONS": {
    "title": "Web Applications",
    "link": "Web Applications",
    "button": { "read_more": "Read More" },
    "caption": "Scalable web applications tailored to your business needs.",
    "motto": "We build web apps tailored to your industry",
    "metadata": {
      "title": "Web Applications – Hello Software",
      "description": "We create high-performance web applications using modern technologies."
    },
    "text": "At Hello Software, we specialize in designing and developing web applications – from simple admin panels to complex B2B systems, SaaS platforms, and multi-integration solutions.\n\nEach project is handled individually – we analyze user needs and business goals to select the right technology stack (e.g., React, Node.js, TypeScript, GraphQL).\n\nOur web apps are fast, secure, responsive, and scalable – ready to support your business growth.\n\nWhat we offer:\n– Full-cycle web application development (frontend + backend)\n– System architecture design for web platforms\n– Integration with external APIs, databases, and ERP/CRM systems\n– Progressive Web App (PWA) implementation\n– High-quality code, testing, and technical documentation\n– Continuous support and post-launch development\n\nAt Hello Software, we combine technical expertise with strategic thinking – we create applications that grow businesses, automate processes, and boost efficiency."
  },
  "MOBILE_APPLICATIONS": {
    "title": "Mobile Applications",
    "link": "Mobile Applications",
    "button": { "read_more": "Read More" },
    "caption": "Modern mobile applications for Android and iOS – intuitive and efficient.",
    "motto": "We create mobile apps tailored to the user",
    "metadata": {
      "title": "Mobile Applications – Hello Software",
      "description": "We build fast and intuitive mobile applications for Android and iOS."
    },
    "text": "We design and develop mobile applications that are fast, modern-looking, and user-centered. At Hello Software, we create hybrid mobile apps – with a single codebase for both Android and iOS (e.g., using React Native), which helps reduce development time and costs.\n\nWe tailor the design to your industry and target audience – each app is developed based on an analysis of features, user needs, and business goals.\n\nOur mobile apps offer:\n– Modern design following UX and UI principles\n– Smooth performance and optimization for efficiency\n– Offline functionality and access to native device features\n– Integration with backend systems, APIs, and databases\n– Compliance with Google Play and App Store guidelines\n– Full support from project design to testing, publication, and ongoing development\n\nWith Hello Software, you will create a mobile app that attracts users, engages them, and delivers real business value."
  },
  "SERVER_APPLICATIONS": {
    "title": "APIs and Integrations",
    "link": "System Integrations",
    "button": { "read_more": "Read More" },
    "motto": "We build efficient and scalable APIs",
    "caption": "API development and system integrations – automation and connectivity.",
    "metadata": {
      "title": "APIs and Integrations – Hello Software",
      "description": "We develop APIs and system integrations to support automation and optimization."
    },
    "text": "At Hello Software, we design and implement reliable server-side solutions that enable systems to communicate efficiently and automate data flow.\n\nWe build modern APIs (REST, GraphQL) and carry out integrations between CRM, ERP, CMS systems, e-commerce platforms, and mobile/web applications.\n\nEach integration project starts with a thorough technical and business analysis – we choose solutions that best fit your company's needs.\n\nOur solutions allow you to:\n– Automate data exchange between different systems\n– Improve internal business processes\n– Enhance data security and consistency\n– Provide access to data for clients, partners, or frontends via well-designed APIs\n\nWhat we offer:\n– Custom API design and development (REST/GraphQL)\n– Integration with external systems (e.g., payment, logistics, accounting, marketplaces)\n– Middleware – communication layers between systems\n– Queue-based and asynchronous systems (e.g., RabbitMQ, Kafka)\n– Secure authentication and authorization (OAuth2, JWT)\n– Monitoring, testing, and technical documentation\n\nTrust Hello Software with your system integrations – gain consistency, automation, and enterprise-grade efficiency."
  },
  "SEARCH_ENGINE_OPTIMIZATION": {
    "title": "SEO Services",
    "link": "SEO",
    "button": { "read_more": "Read More" },
    "motto": "Boost your visibility and attract high-value traffic",
    "caption": "Grow your website traffic with effective SEO strategies.",
    "metadata": {
      "title": "SEO – Hello Software",
      "description": "Improve your Google visibility with proven SEO techniques."
    },
    "text": "Make sure your website shows up where your customers are searching.\n\nAt Hello Software, we offer comprehensive SEO services – from technical site audits and keyword strategies to link building and competitor analysis.\n\nWe create personalized strategies based on your market and business goals to achieve long-term visibility in Google.\n\nOur services include:\n– Technical and content SEO audits\n– Code, structure, and Core Web Vitals optimization (where possible)\n– Optimized content creation (landing pages, blogs, service descriptions)\n– Link building strategies\n– Keyword strategies tailored to your industry and location\n– Ongoing performance reports and strategic adjustments\n\nWith Hello Software, your website won’t just look good – it will actually help drive sales and brand awareness online."
  },
  "CLOUD_COMPUTING_SOLUTIONS": {
    "title": "Cloud Solutions",
    "link": "Cloud Solutions",
    "button": { "read_more": "Read More" },
    "motto": "Complete cloud solutions that support business growth",
    "caption": "Secure and scalable cloud solutions for your business.",
    "metadata": {
      "title": "Cloud Solutions – Hello Software",
      "description": "Modern cloud services – security, performance, and flexibility."
    },
    "text": "At Hello Software, we implement cloud systems based on AWS, Google Cloud, Microsoft Azure, and other popular platforms.\n\nWe deliver reliability, savings, and flexibility – just what your modern IT environment needs.\n\nOur services include:\n– Migration of existing systems to the cloud\n– Building cloud-native infrastructure (CI/CD, autoscaling, load balancing)\n– Configuration of containers and serverless services (Docker, Kubernetes, Lambda)\n– Cloud cost monitoring and optimization\n– Advanced security and data backups\n– Full DevOps support and infrastructure management\n\nTrust Hello Software to deliver scalable cloud solutions that grow with your business."
  },
  "OUTSOURCING": {
    "title": "IT Outsourcing",
    "link": "Outsourcing",
    "button": { "read_more": "Read More" },
    "motto": "Access top IT talent without building an in-house team",
    "caption": "External IT teams – cost-effective and professional technical support.",
    "metadata": {
      "title": "IT Outsourcing – Hello Software",
      "description": "We provide external IT teams – flexible and high-quality services."
    },
    "text": "At Hello Software, we offer IT outsourcing – a flexible model to help you complete projects, scale production, or fill skill gaps fast.\n\nOur team includes experienced developers, project managers, testers, and DevOps engineers – ready to join your team on your terms.\n\nWhy choose us?\n– Dedicated teams or individual specialists for specific tasks\n– High availability and rapid onboarding\n– Flexible cooperation models (body leasing, team leasing, project-based)\n– Full project control – we provide the people and the quality\n– Reduced hiring costs and recruitment risks\n– Proven experience in IT projects\n\nIT outsourcing with Hello Software means not just savings – but real value and scalability for your business."
  },
  "TECHNOLOGIES": {
    "title": "Technologies We Use",
    "link": "Technologies",
    "caption": "Discover cutting-edge technologies we use to build modern websites and apps.",
    "metadata": {
      "title": "Technologies – Hello Software",
      "description": "Discover the technologies we use to build modern digital solutions – React, Node.js, TypeScript, and more."
    }
  },
  "TYPESCRIPT": {
    "title": "TypeScript",
    "link": "TypeScript",
    "caption": "Safe apps with TypeScript – better code, fewer bugs.",
    "motto": "Modern and secure JavaScript development",
    "metadata": {
      "title": "TypeScript – Hello Software",
      "description": "We build apps with TypeScript – a modern, typed JavaScript language."
    },
    "text": "TypeScript is a superset of JavaScript that adds static typing and improves code control.\n\nAt Hello Software, we use TypeScript in web, mobile, and backend projects to boost security, clarity, and code stability.\n\nWith TypeScript, you get:\n– Fewer runtime errors thanks to early bug detection\n– Better documentation and code editor suggestions\n– Easier maintenance and scaling of large codebases\n– Full compatibility with JavaScript and modern frameworks (React, Node.js)\n\nAt Hello Software, we deliver apps that are faster, safer, and more scalable with TypeScript."
  },
  "REACT": {
    "title": "React",
    "link": "React",
    "caption": "Fast, dynamic user interfaces – built with React.",
    "motto": "Modern and responsive user interfaces",
    "metadata": {
      "title": "React – Hello Software",
      "description": "We build frontends with React – fast, scalable, and modern."
    },
    "text": "React is a JavaScript library developed by Facebook for building modern and interactive user interfaces.\n\nAt Hello Software, React is our go-to tool for websites, web apps, and PWAs (Progressive Web Apps).\n\nWith React, we provide:\n– Lightning-fast loading and smooth performance (SPA)\n– Component-based architecture for easy development and testing\n– High performance and SEO optimization using Next.js\n– Seamless integration with backend APIs via REST or GraphQL\n\nChoose React with Hello Software for a future-proof, flexible frontend your users will love."
  },
  "NODE_JS": {
    "title": "Node.js",
    "link": "Node.js",
    "caption": "Backend and API development with Node.js – fast and scalable.",
    "motto": "Fast and scalable JavaScript backends",
    "metadata": {
      "title": "Node.js – Hello Software",
      "description": "We build backends and APIs with Node.js – fast, flexible, and robust."
    },
    "text": "Node.js allows building high-performance server-side applications using the same language as the frontend – JavaScript.\n\nAt Hello Software, we use Node.js to build backends, APIs, and high-traffic systems.\n\nWhy choose Node.js:\n– Unified tech stack – JavaScript everywhere\n– Efficient handling of many requests with async architecture\n– Great for real-time apps (chats, notifications, streaming)\n– Rich ecosystem of libraries (NPM)\n\nHello Software delivers reliable, scalable Node.js backends – ready for integration and growth."
  },
  "REACT_NATIVE": {
    "title": "React Native",
    "link": "React Native",
    "caption": "Mobile app development with React Native – one codebase for iOS and Android.",
    "motto": "Build mobile apps for Android and iOS from one codebase",
    "metadata": {
      "title": "React Native – Hello Software",
      "description": "We build mobile apps with React Native – fast, efficient, and modern."
    },
    "text": "React Native lets you build native mobile apps using JavaScript and React – from a single codebase for both Android and iOS.\n\nAt Hello Software, React Native is our tool of choice for creating high-performance, great-looking mobile apps quickly.\n\nWhat you get with React Native:\n– Time and budget savings – one codebase, two platforms\n– Near-native performance\n– Fast updates and deployments with Hot Reloading\n– Integration with native device features (camera, GPS, Bluetooth)\n\nHello Software builds mobile apps that look and feel native – without compromise."
  },
  "ABOUT_US": {
    "title": "About Hello Software",
    "link": "About Us",
    "caption": "Learn more about Hello Software – our team, mission, and commitment to innovation.",
    "metadata": {
      "title": "About Us – Hello Software",
      "description": "Meet the team behind Hello Software – experts in web, mobile, and cloud development."
    },
    "sections_1": {
      "title": "Our Core Values",
      "caption": "The foundation behind every successful project we deliver.",
      "text": "At Hello Software, we are guided by values such as transparency, innovation, accountability, and commitment. We believe that only through honest, collaborative partnerships can we deliver top-quality software solutions that truly support the growth of our clients' businesses."
    },
    "sections_2": {
      "title": "Our Team Culture",
      "caption": "Driven by passion, built on trust and mutual respect.",
      "text": "We foster a work environment focused on teamwork, open communication, and continuous learning. Every team member at Hello Software has a real impact on both projects and the company. We promote a culture of feedback, flexibility, and work-life balance that fuels productivity and creativity."
    },
    "sections_3": {
      "title": "Our Vision",
      "caption": "Modern technologies serving people and business growth.",
      "text": "Our vision is to create intelligent, scalable, and accessible software solutions that meet the evolving needs of today’s digital world. We strive to be a trusted tech partner for businesses worldwide, enabling their digital transformation and helping them achieve their goals."
    },
    "sections_4": {
      "title": "Why Choose Us?",
      "caption": "Your business goals in the hands of a skilled software team.",
      "text": "Choosing Hello Software means partnering with a team that understands your needs and translates them into effective technology solutions. We combine experience, innovation, and transparency in everything we do. Each project is built on strategic analysis, a tailored plan, and the highest quality standards—from concept to deployment and beyond."
    }
  },
  "CONTACT": {
    "title": "Contact Hello Software",
    "link": "Contact",
    "caption": "Do you need a website, mobile app, or e-commerce solution? Get in touch with our team of IT experts to discuss your project.",
    "metadata": {
      "title": "Contact Hello Software – Expert IT Services",
      "description": "Have an idea for a digital product? Contact Hello Software and get a free consultation for your website, mobile app, or custom software project."
    },
    "CONNTACT_SECTION": {
      "form": {
        "title": "Need a website or mobile app?",
        "caption": "Drop us a message",
        "input": {
          "email": {
            "placeholder": "Email address *",
            "error": "Please enter a valid email address"
          },
          "name": {
            "placeholder": "Name",
            "error": "Please enter a valid name"
          },
          "phone": {
            "placeholder": "Phone number",
            "error": "Please enter a valid phone number"
          },
          "message": {
            "placeholder": "Tell us about your project *",
            "error": "Your message should contain at least 10 characters"
          }
        },
        "submit": "Send Message",
        "sending": "Sending...",
        "success": "Message sent successfully. We'll get back to you soon!",
        "error": "Something went wrong. Please try again later."
      },
      "informations": {
        "title": "Contact Information",
        "caption": "Reach out to us – we’ll guide you, suggest solutions, and provide a quote for your IT project",
        "location": {
          "title": "Our Location",
          "detail": "Wrocław, Poland"
        },
        "mail": {
          "title": "Email us",
          "detail": "contact@hello-software.com"
        }
      }
    }
  },
  "SUPPORT": {
    "title": "Helpful Links",
    "link": "Helpful Links",
    "caption": "Access useful resources, documentation, and policies related to our services.",
    "metadata": {
      "title": "Helpful Links – Hello Software",
      "description": "Explore helpful links and important resources from Hello Software to stay informed and supported."
    }
  },
  "TERMS": {
    "title": "Terms of Service",
    "link": "Terms of Service",
    "caption": "Learn the conditions for using our services and the rules governing this website.",
    "metadata": {
      "title": "Terms of Service – Hello Software",
      "description": "Read the terms of Hello Software to learn more about the rules for using our digital services."
    },
    "rules": [
      {
        "title": "1. Definitions",
        "content": "Service Provider – JavaScript Solutions Igor Dudek, operating under the name Hello Software, VAT ID: PL8943163760, contact email: contact@hello-software.com.\n\nUser – an individual or entity using services provided by the Service Provider, such as website development, mobile applications, e-commerce systems, and other IT solutions."
      },
      {
        "title": "2. Scope of Services",
        "content": "Hello Software provides comprehensive IT services, including:\n\n- Modern website development,\n- Mobile apps for Android and iOS,\n- E-commerce solutions including online stores,\n- Web and backend applications,\n- API and system integrations,\n- SEO optimization, cloud services, and IT outsourcing."
      },
      {
        "title": "3. Terms of Service Usage",
        "content": "Services are provided based on a contract signed with the User.\n\nThe User agrees to use the services in compliance with applicable laws.\n\nThe Service Provider reserves the right to modify the service offering at any time."
      },
      {
        "title": "4. Payments",
        "content": "Fees for services are agreed upon individually within the scope of the signed contracts."
      },
      {
        "title": "5. Complaints",
        "content": "Complaints regarding provided services should be submitted to: contact@hello-software.com."
      },
      {
        "title": "6. Liability",
        "content": "The Service Provider shall not be liable for damages resulting from improper use of the services, or for delays caused by force majeure."
      },
      {
        "title": "7. Termination",
        "content": "The contract may be terminated by mutual agreement or under conditions specified in the contract."
      },
      {
        "title": "8. Amendments to the Terms",
        "content": "The Service Provider reserves the right to amend the Terms. Users will be notified of changes."
      },
      {
        "title": "9. Intellectual Property",
        "content": "Unless otherwise agreed, all intellectual property rights to the developed software, websites, or systems remain with Hello Software until full payment is made."
      },
      {
        "title": "10. Service Level Agreement (SLA)",
        "content": "The level of support and response times are defined in individual agreements. Standard SLA includes email response within 48 hours on working days."
      },
      {
        "title": "11. Testing and Acceptance",
        "content": "Before final delivery, the software undergoes testing by both parties. The User is obliged to report any issues within 14 days of delivery."
      },
      {
        "title": "12. Technical Support",
        "content": "Post-launch support is available under a separate support agreement or based on the agreed maintenance terms."
      }
    ]
  },
  "POLICY": {
    "title": "Privacy Policy",
    "link": "Privacy Policy",
    "caption": "Learn how we protect your privacy and process personal data.",
    "metadata": {
      "title": "Privacy Policy – Hello Software",
      "description": "See how Hello Software processes and protects your personal data in accordance with GDPR regulations."
    },
    "rules": [
      {
        "title": "1. Data Controller",
        "content": "The data controller is JavaScript Solutions Igor Dudek, operating under the name Hello Software, VAT ID 8943163760, contact email: contact@hello-software.com."
      },
      {
        "title": "2. Purposes of Data Processing",
        "content": "We process personal data to provide IT services, including website and mobile app development, e-commerce systems, APIs and integrations, as well as for marketing purposes if the user gives consent."
      },
      {
        "title": "3. Legal Basis for Processing",
        "content": "Personal data is processed on the basis of user consent, contract execution, and the legitimate interests of the controller."
      },
      {
        "title": "4. Scope of Data Processed",
        "content": "We collect data such as name, email address (if voluntarily provided), and analytical data about website usage (Google Analytics)."
      },
      {
        "title": "5. Data Recipients",
        "content": "Data may be transferred to entities providing technical services, such as hosting providers, web analytics companies (e.g., Google Analytics), and external partners involved in contract execution."
      },
      {
        "title": "6. Transfer of Data Outside the EEA",
        "content": "Data may be transferred to countries outside the EEA, especially to Google (USA) when using Google Analytics. Google provides adequate data protection safeguards."
      },
      {
        "title": "7. User Rights",
        "content": "Users have the right to access, rectify, delete, transfer their data, and restrict processing. Consent can be withdrawn at any time by contacting the data controller."
      },
      {
        "title": "8. Contact Regarding Personal Data",
        "content": "To exercise your rights, contact the data controller at: contact@hello-software.com."
      },
      {
        "title": "9. Data Retention",
        "content": "Personal data is retained for the duration of the contract and for the period required by law, depending on the type of data."
      }
    ]
  },
  "COOKIES": {
    "title": "Cookie Policy",
    "link": "Cookies",
    "caption": "Learn how we use cookies to improve our website.",
    "metadata": {
      "title": "Cookie Policy – Hello Software",
      "description": "See how Hello Software uses cookies to improve website functionality and analyze traffic."
    },
    "rules": [
      {
        "title": "1. What Are Cookies",
        "content": "Cookies are small text files stored on the user's device that enable the identification of the device and save session information."
      },
      {
        "title": "2. Types of Cookies",
        "content": "Necessary cookies – enable the use of basic site functions, such as security and access to services (e.g., functionality_storage, security_storage).\n\nAnalytical cookies – collect anonymous data on website usage, e.g., Google Analytics.\n\nMarketing and advertising cookies – allow personalized ads to be displayed.\n\nPersonalization cookies – adapt website content to user preferences."
      },
      {
        "title": "3. Legal Basis and GDPR / ePrivacy Compliance",
        "content": "According to the GDPR and ePrivacy Directive, necessary cookies are used without user consent. All other cookies (e.g., analytical, marketing) require prior consent, which the user can give or withdraw at any time."
      },
      {
        "title": "4. Purpose of Using Cookies",
        "content": "Cookies are used to improve website functionality, ensure security, analyze traffic, and adapt content to user needs. In particular, we use Google Analytics to monitor website usage."
      },
      {
        "title": "5. Cookie Consent",
        "content": "A cookie banner is displayed during the user's first visit, allowing consent for specific cookie categories. This consent can be withdrawn at any time via cookie settings or the browser."
      },
      {
        "title": "6. Managing Cookies",
        "content": "Users can change cookie settings in their browser at any time. Instructions are available in browser documentation. Consent can also be managed via the website's cookie banner."
      },
      {
        "title": "7. Google Analytics",
        "content": "We use Google Analytics on our website to analyze traffic. Data is collected anonymously. Details are available in Google's privacy policy: https://policies.google.com/privacy"
      }
    ]
  },
  "FOOTER": {
    "title": "Would you like us to contact with you? <br></br> Leave your email below",
    "link": "To Page Down",
    "caption": "Hello Software provides innovative, user-centric software solutions designed to streamline your business processes. With a focus on efficiency, scalability, and ease of use, we offer cutting-edge tools that  empower your team to achieve greater productivity and growth.",
    "form": {
      "email": {
        "placeholder": "Email address *"
      },
      "error": {
        "general": "An error occurred. Please try again later.",
        "email": "Please enter a valid email address"
      },
      "success": "Your message has been sent. We'll get back to you shortly!",
      "button": {
        "default": "Contact",
        "sending": "Sending..."
      }
    },
    "all-rights-reserved": "© Hello Software 2025. All rights reserved.",
    "STATS_SECTION": [
      { "title": "5+", "caption": "Years of experience" },
      { "title": "Worldwide", "caption": "From Poland, available worldwide" },
      { "title": "+100%", "caption": "Growth from the beginning" }
    ]
  },
  "COOKIES_BANNER": {
    "title": "Cookies",
    "link": "Cookie Policy",
    "caption": "We use cookies to ensure the proper functioning of the website, analyze traffic, and display personalized ads. You can manage your preferences or accept all to use the full functionality of the site. Your data is processed in accordance with the GDPR and used solely for specified purposes.",
    "preferences": {
      "ad_storage": "Advertising cookies – enable storing data related to ads to display personalized content based on the user's interests.",
      "analytics_storage": "Analytics cookies – allow for collecting data like visited pages and time spent on the site, helping to optimize user experience.",
      "personalization_storage": "Personalization cookies – store user preferences to enable a personalized navigation experience during future visits.",
      "ad_user_data": "User data cookies – allow the transfer of anonymous user data to advertising systems like Google Ads to improve ad targeting.",
      "ad_personalization": "Marketing cookies – support the personalization of advertising content based on user behavior to increase ad relevance."
    },

    "button": {
      "settings": {
        "open": "Cookie Settings",
        "close": "Close Settings"
      },
      "reject": "Reject All",
      "submit": {
        "custom": "Accept Selected",
        "acceptAll": "Accept All"
      }
    }
  }
}
