{
  "HOME_PAGE": {
    "title": "Hello",
    "link": "Strona Główna",
    "caption": "Nowoczesne strony, aplikacje mobilne i systemy IT – kompleksowe wsparcie technologiczne.",
    "metadata": {
      "title": "Hello Software – Tworzenie Stron i Aplikacji",
      "description": "Software House zajmujący się tworzeniem stron internetowych, aplikacjami mobilnymi i webowymi oraz zapewniamy wsparcie IT dla firm."
    },
    "HERO_SECTION": {
      "text": "Jesteśmy doświadczonym software housem, który dostarcza kompleksowe rozwiązania IT dostosowane do potrzeb Twojej firmy. Projektujemy szybkie, responsywne i zoptymalizowane strony www, funkcjonalne aplikacje mobilne na Androida i iOS oraz skalowalne systemy e-commerce. Szukasz niezawodnego partnera technologicznego? Skontaktuj się z nami – zaprojektujemy rozwiązanie idealne dla Twojego biznesu",
      "button": "Skontaktuj się z nami"
    },
    "SERVICES_SECTION": {},
    "HOW_IT_WORK_SECTION": {
      "title": "Proces Rozwoju Oprogramowania",
      "caption": "Poznaj każdy etap naszej pracy – od strategii i projektowania UX, aż po wdrożenie i optymalizację. Upraszczamy złożone procesy, dostarczając szybkie, skalowalne i przyjazne użytkownikom rozwiązania.",
      "steps": [
        {
          "title": "Strategia i Projektowanie UX",
          "description": "Określamy cele biznesowe, grupę docelową i kluczowe funkcje. Tworzymy makiety oraz finalne projekty graficzne, zapewniające intuicyjną nawigację i układ zwiększający konwersje."
        },
        {
          "title": "Rozwój Front-End i Back-End",
          "description": "Zamieniamy zaakceptowane projekty w szybkie i responsywne strony internetowe z wykorzystaniem nowoczesnych technologii jak React. W razie potrzeby wdrażamy skalowalną architekturę backendu."
        },
        {
          "title": "Testy, Optymalizacja i Wdrożenie",
          "description": "Przeprowadzamy dokładne testy wydajności, responsywności, zgodności z SEO i bezpieczeństwa. Usuwamy błędy, optymalizujemy szybkość ładowania i wdrażamy witrynę na niezawodnym serwerze z integracją analityki."
        }
      ],
      "STATS_SECTION": [
        { "title": "5+", "caption": "Lat doświadczenia" },
        { "title": "Z Polski", "caption": "Dostępni globalnie" },
        { "title": "+100%", "caption": "Wzrost od początku działalności" }
      ]
    },
    "CONNTACT_SECTION": {
      "form": {
        "title": "Potrzebujesz strony internetowej lub aplikacji?",
        "caption": "Napisz do nas",
        "input": {
          "email": {
            "placeholder": "Adres e-mail *",
            "error": "Wprowadź poprawny adres e-mail"
          },
          "name": {
            "placeholder": "Imię",
            "error": "Podaj poprawne imię"
          },
          "phone": {
            "placeholder": "Numer telefonu",
            "error": "Podaj poprawny numer telefonu"
          },
          "message": {
            "placeholder": "Opisz swój projekt *",
            "error": "Opis projektu powinien zawierać co najmniej 10 znaków"
          }
        },
        "submit": "Wyślij wiadomość",
        "sending": "Wysyłanie...",
        "success": "Wiadomość została wysłana. Skontaktujemy się z Tobą wkrótce!",
        "error": "Wystąpił błąd. Spróbuj ponownie później."
      },
      "informations": {
        "title": "Nasze dane kontaktowe",
        "caption": "Skontaktuj się z nami – doradzimy, zaproponujemy rozwiązania i przygotujemy wycenę projektu IT",
        "location": {
          "title": "Nasza lokalizacja",
          "detail": "Wrocław, Polska"
        },
        "mail": {
          "title": "Napisz do nas",
          "detail": "contact@hello-software.com"
        }
      }
    }
  },
  "SERVICES": {
    "title": "Usługi",
    "link": "Usługi",
    "caption": "Oferta usług programistycznych dostosowanych do potrzeb Twojej firmy",
    "motto": "Zamień swój pomysł w realny biznes",
    "metadata": {
      "title": "Usługi IT – Hello Software",
      "description": "Oferujemy strony internetowe, aplikacje mobilne, integracje API i rozwiązania chmurowe."
    },
    "section": {
      "title": "Nowoczesne Usługi, które Oferujemy",
      "motto": "Zamień swój pomysł w realny biznes"
    },
    "STATS_SECTION": [
      { "title": "5+", "caption": "Lat doświadczenia" },
      { "title": "Na całym świecie", "caption": "Z Polski, dostępni globalnie" },
      { "title": "+100%", "caption": "Wzrost od początku działalności" }
    ]
  },
  "WEBSITES": {
    "title": "Strony Internetowe",
    "link": "Strony Internetowe",
    "button": { "read_more": "Zobacz Więcej" },
    "caption": "Nowoczesne strony internetowe – szybkie, responsywne i zoptymalizowane pod SEO.",
    "motto": "Tworzymy strony, które pracują na Twój sukces",
    "metadata": {
      "title": "Strony Internetowe – Hello Software",
      "description": "Projektujemy nowoczesne strony www zoptymalizowane pod kątem SEO i UX."
    },
    "text": "W Hello Software specjalizujemy się w kompleksowym projektowaniu i tworzeniu stron internetowych, które nie tylko świetnie wyglądają, ale przede wszystkim realizują konkretne cele biznesowe naszych klientów. Niezależnie od tego, czy potrzebujesz prostej strony typu landing page, rozbudowanego serwisu firmowego, czy zaawansowanego systemu CMS – jesteśmy gotowi stworzyć rozwiązanie idealnie dopasowane do Twoich potrzeb.\n\nKażdy projekt rozpoczynamy od szczegółowej analizy wymagań, ponieważ wierzymy, że skuteczna strona internetowa powstaje tylko wtedy, gdy rozumiemy cel i odbiorcę. Nasze podejście jest w pełni indywidualne – nie korzystamy z gotowych szablonów, tylko projektujemy i kodujemy rozwiązania od podstaw, dopasowane do Twojej branży, strategii marketingowej i oczekiwań użytkowników.\n\nTworzymy strony responsywne, szybkie, nowoczesne i zgodne z najnowszymi standardami UX/UI oraz SEO. Dbamy o to, by każda strona internetowa była zoptymalizowana pod kątem wyszukiwarek (SEO), co zwiększa jej widoczność w Google i pozwala skutecznie przyciągać nowych klientów.\n\nW Hello Software oferujemy:\n- Projektowanie i rozwój nowoczesnych stron internetowych\n- Landing pages zoptymalizowane pod konwersję\n- Rozbudowane serwisy firmowe i portfolio\n- Integracje z systemami CMS\n- Autorskie panele zarządzania treścią\n- Pełną optymalizację pod SEO i szybkość działania\n- Wsparcie techniczne i rozwój po wdrożeniu"
  },
  "E_COMMERCE": {
    "title": "Sklepy Internetowe",
    "link": "E-Commerce",
    "button": { "read_more": "Zobacz Więcej" },
    "caption": "Bezpieczne i skalowalne sklepy internetowe – maksymalizacja konwersji.",
    "motto": "Tworzymy sklepy internetowe, które zarabiają",
    "metadata": {
      "title": "Sklepy Internetowe – Hello Software",
      "description": "Tworzymy sklepy e-commerce skoncentrowane na wydajności i konwersji."
    },
    "text": "W Hello Software tworzymy nowoczesne, skalowalne i bezpieczne sklepy internetowe. \n Każdy projekt e-commerce realizujemy w oparciu o indywidualne potrzeby klienta – nie korzystamy z gotowych szablonów, lecz projektujemy rozwiązania dostosowane do konkretnego modelu biznesowego, grupy docelowej i celów sprzedażowych.\nOferujemy kompleksowe wdrożenia, od zaprojektowania intuicyjnego interfejsu użytkownika (UX/UI), przez integrację z systemami płatności i logistyką, po optymalizację SEO i analitykę sprzedaży.\nTworzymy zarówno małe sklepy dla start-upów, jak i rozbudowane platformy sprzedażowe z wieloma integracjami – m.in. z CRM, ERP, narzędziami marketingowymi czy marketplace'ami (np. Allegro, Amazon).\n\nNasze sklepy internetowe to:\n – Szybkie i responsywne rozwiązania dostosowane do urządzeń mobilnych\n – Wysoka konwersja dzięki dopracowanemu UX i nowoczesnemu designowi\n – Integracja z systemami płatności (Stripe, PayU, Przelewy24, Klarna itp.)\n – Zgodność z najnowszymi standardami SEO i Google Core Web Vitals\n – Pełna kontrola nad treścią dzięki intuicyjnemu CMS\n – Bezpieczeństwo danych klientów i zgodność z RODO\n\nRozwijaj swój sklep z partnerem technologicznym, który zna się na rzeczy – wybierz Hello Software i postaw na skuteczny e-commerce."
  },
  "WEB_APPLICATIONS": {
    "title": "Aplikacje Internetowe",
    "link": "Aplikacje Internetowe",
    "button": { "read_more": "Zobacz Więcej" },
    "caption": "Skalowalne aplikacje webowe dopasowane do Twoich potrzeb biznesowych.",
    "motto": "Tworzymy aplikacje internetowe, dostosowane do branży",
    "metadata": {
      "title": "Aplikacje Internetowe – Hello Software",
      "description": "Tworzymy wydajne aplikacje webowe z wykorzystaniem nowoczesnych technologii."
    },
    "text": "W Hello Software specjalizujemy się w projektowaniu i tworzeniu aplikacji internetowych – od prostych paneli administracyjnych po rozbudowane systemy B2B, SaaS i platformy z wieloma integracjami.\nKażdy projekt realizujemy indywidualnie – analizujemy potrzeby użytkowników, cele biznesowe i dobieramy odpowiednią technologię (np. React, Node.js, TypeScript, GraphQL).\n\nNasze aplikacje są szybkie, bezpieczne, responsywne i skalowalne – gotowe na rozwój Twojego biznesu.\n\nCo oferujemy:\n – Tworzenie aplikacji od podstaw (frontend + backend)\n – Projektowanie architektury systemów webowych\n – Integracje z zewnętrznymi API, bazami danych i systemami ERP/CRM\n – Wdrożenia PWA (Progressive Web Apps)\n – Wysoką jakość kodu, testy i dokumentację techniczną\n – Stałe wsparcie i rozwój aplikacji po wdrożeniu\n\nW Hello Software łączymy wiedzę technologiczną z myśleniem strategicznym – tworzymy aplikacje, które rozwijają biznes, automatyzują procesy i zwiększają efektywność."
  },
  "MOBILE_APPLICATIONS": {
    "title": "Aplikacje Mobilne",
    "link": "Aplikacje Mobilne",
    "button": { "read_more": "Zobacz Więcej" },
    "caption": "Nowoczesne aplikacje mobilne Android i iOS – intuicyjne i wydajne.",
    "motto": "Tworzymy Aplikacje Mobile, skrojone pod użytkownika",
    "metadata": {
      "title": "Aplikacje Mobilne – Hello Software",
      "description": "Budujemy szybkie i intuicyjne aplikacje mobilne na Androida i iOS."
    },
    "text": "Projektujemy i tworzymy aplikacje mobilne, które działają szybko, wyglądają nowocześnie i są dopasowane do użytkowników.\n W Hello Software tworzymy aplikacje mobilne hybrydowe – z jednym kodem dla Androida i iOS (np. w React Native), co pozwala skrócić czas realizacji i zredukować koszty.\n\nDostosowujemy projekt do branży i grupy docelowej – każda aplikacja powstaje w oparciu o analizę funkcji, potrzeb użytkowników i celów biznesowych.\n\nNasze aplikacje mobilne to:\n – Nowoczesny design zgodny z zasadami UX i UI\n – Płynne działanie i optymalizacja pod kątem wydajności\n – Funkcjonalności offline i dostęp do natywnych funkcji urządzenia\n – Integracja z systemami backendowymi, API i bazami danych\n – Zgodność z wytycznymi Google Play i App Store\n – Pełne wsparcie od projektu, przez testy, po publikację i rozwój\n\nZ Hello Software stworzysz aplikację mobilną, która przyciąga użytkowników, angażuje i generuje realną wartość biznesową."
  },
  "SERVER_APPLICATIONS": {
    "title": "API i Integracje",
    "link": "Integracje Systemowe",
    "button": { "read_more": "Zobacz Więcej" },
    "motto": "Tworzymy wydajne i skalowane API",
    "caption": "Tworzenie API i integracji systemowych – automatyzacja i łączność.",
    "metadata": {
      "title": "API i Integracje – Hello Software",
      "description": "Tworzymy API oraz integracje między systemami w celu automatyzacji i optymalizacji."
    },
    "text": "W Hello Software projektujemy i wdrażamy niezawodne rozwiązania serwerowe, które pozwalają systemom efektywnie się komunikować i automatyzować przepływ danych.\n\nTworzymy nowoczesne API (REST, GraphQL) oraz realizujemy integracje pomiędzy systemami CRM, ERP, CMS, platformami e-commerce i aplikacjami mobilnymi/webowymi.\n\nKażdy projekt integracyjny poprzedzamy analizą technologiczną i biznesową – dobieramy rozwiązania, które najlepiej odpowiadają na potrzeby Twojej firmy.\n\nDzięki naszym rozwiązaniom możesz:\n – Zautomatyzować obieg danych między różnymi systemami\n – Usprawnić działanie procesów wewnętrznych\n – Zwiększyć bezpieczeństwo i spójność danych\n – Udostępniać dane klientom, partnerom lub frontendowi przez dobrze zaprojektowane API\n\nCo oferujemy:\n – Projektowanie i tworzenie dedykowanych API (REST/GraphQL)\n – Integracje z systemami zewnętrznymi (np. płatności, logistyka, księgowość, marketplace’y)\n – Middleware – pośrednie warstwy komunikacyjne między systemami\n – Systemy kolejkowe i asynchroniczne (np. RabbitMQ, Kafka)\n – Bezpieczne uwierzytelnianie i autoryzacja (OAuth2, JWT)\n – Monitoring, testy i dokumentacja techniczna\n\nZaufaj Hello Software w integracji Twoich systemów – zyskaj spójność, automatyzację i efektywność działania na poziomie enterprise."
  },
  "SEARCH_ENGINE_OPTIMIZATION": {
    "title": "Pozycjonowanie SEO",
    "link": "Pozycjonowanie",
    "button": { "read_more": "Zobacz Więcej" },
    "motto": "Zwiększ widoczność i pozyskuj wartościowy ruch",
    "caption": "Zwiększ widoczność strony – skuteczne działania SEO dla większego ruchu.",
    "metadata": {
      "title": "SEO – Hello Software",
      "description": "Popraw widoczność strony w Google dzięki skutecznym technikom SEO."
    },
    "text": "Zadbaj o to, by Twoja strona była widoczna tam, gdzie szukają Cię klienci.\n\nW Hello Software oferujemy kompleksowe usługi SEO – od technicznej optymalizacji strony, przez strategię słów kluczowych, aż po link building i analizę konkurencji.\n\nPracujemy indywidualnie z każdą firmą – analizujemy rynek, cele biznesowe i budujemy długoterminową strategię wzrostu widoczności w Google.\n\nCo zapewniamy:\n– Audyt SEO techniczny i contentowy\n– Gdy jest taka możliwość, optymalizację kodu, struktury strony, Core Web Vitals\n– Tworzenie zoptymalizowanych treści (landing pages, blogi, opisy usług)\n– Budowę profilu linków (Zadbaj o to, by Twoja strona była widoczna tam, gdzie szukają Cię klienci.\n– Strategię słów kluczowych dopasowaną do branży i lokalizacji\n– Raportowanie efektów i ciągłe dostosowywanie działań\n\nZ Hello Software Twoja strona nie tylko będzie wyglądać dobrze – będzie też realnie działać na rzecz Twojej sprzedaży i rozpoznawalności online."
  },
  "CLOUD_COMPUTING_SOLUTIONS": {
    "title": "Rozwiązania Chmurowe",
    "link": "Rozwiązania Chmurowe",
    "motto": "Kompleksowe rozwiązania chmurowe, które wspierają rozwój firm",
    "button": { "read_more": "Zobacz Więcej" },
    "caption": "Bezpieczne i skalowalne rozwiązania chmurowe dla firm.",
    "metadata": {
      "title": "Rozwiązania Chmurowe – Hello Software",
      "description": "Nowoczesne usługi chmurowe – bezpieczeństwo, wydajność i elastyczność."
    },
    "text": "W Hello Software wdrażamy systemy w chmurze oparte na Amazon Web Services (AWS), Google Cloud, Microsoft Azure oraz innych popularnych środowiskach.\n\nZ nami zyskujesz niezawodność, oszczędność i elastyczność – dokładnie to, czego potrzebujesz w nowoczesnym środowisku IT.\n\nZakres naszych usług:\n– Migracja istniejących systemów do chmury\n– Budowa infrastruktury cloud-native (CI/CD, auto-skalowanie, load balancing)\n– Konfiguracja kontenerów i usług serverless (Docker, Kubernetes, Lambda)\n– Monitorowanie i optymalizacja kosztów chmurowych\n– Wysokie bezpieczeństwo i kopie zapasowe danych\n– Pełne wsparcie DevOps i zarządzanie infrastrukturą\n\nZaufaj specjalistom z Hello Software – dostarczymy rozwiązania chmurowe, które rosną razem z Twoim biznesem."
  },
  "OUTSOURCING": {
    "title": "Outsourcing IT",
    "link": "Outsourcing",
    "motto": "Zyskaj dostęp do wykwalifikowanych specjalistów IT bez konieczności tworzenia wewnętrznego działu",
    "button": { "read_more": "Zobacz Więcej" },
    "caption": "Zewnętrzne zespoły IT – oszczędność i profesjonalne wsparcie techniczne.",
    "metadata": {
      "title": "Outsourcing IT – Hello Software",
      "description": "Oferujemy zespoły IT na zewnątrz – elastyczność i wysoka jakość usług."
    },
    "text": "W Hello Software oferujemy outsourcing IT – elastyczny model współpracy, dzięki któremu możesz szybko zrealizować projekt, zwiększyć moce produkcyjne lub uzupełnić kompetencje techniczne.\n\nZatrudniamy doświadczonych programistów, project managerów, testerów i DevOpsów – gotowych do działania w Twoim zespole, na Twoich zasadach.\n\nDlaczego warto?\n– Dedykowane zespoły lub pojedynczy specjaliści do konkretnych zadań\n– Wysoka dostępność i szybki onboarding\n– Elastyczne formy współpracy (body leasing, team leasing, projektowo)\n- Pełna kontrola nad projektem – my dostarczamy ludzi i jakość\n– Redukcja kosztów zatrudnienia i ryzyk rekrutacyjnych\n– Doświadczenie w projektach IT\n\nW Hello Software outsourcing IT to nie tylko oszczędność – to realna wartość i skalowalność dla Twojego biznesu."
  },
  "TECHNOLOGIES": {
    "title": "Technologie",
    "link": "Technologie",
    "caption": "Nowoczesne technologie, które napędzają nasze projekty IT.",
    "metadata": {
      "title": "Technologie – Hello Software",
      "description": "Poznaj technologie, które wykorzystujemy w projektach IT."
    }
  },
  "TYPESCRIPT": {
    "title": "TypeScript",
    "link": "TypeScript",
    "caption": "Bezpieczne aplikacje w języku TypeScript – lepszy kod, mniej błędów.",
    "motto": "Nowoczesność i bezpieczeństwo w kodzie JavaScript",
    "metadata": {
      "title": "TypeScript – Hello Software",
      "description": "Tworzymy aplikacje w TypeScript – nowoczesnym i typowanym języku JavaScript."
    },
    "text": "TypeScript to rozszerzenie JavaScript, które zapewnia statyczne typowanie i lepszą kontrolę nad kodem.\n\nW Hello Software wykorzystujemy TypeScript w projektach webowych, mobilnych i backendowych, aby zwiększyć bezpieczeństwo, czytelność oraz stabilność aplikacji.\n\nDzięki TypeScript zyskujesz:\n– Mniej błędów w czasie działania dzięki wczesnemu wykrywaniu problemów\n– Lepszą dokumentację i podpowiedzi w edytorze kodu\n– Większą łatwość utrzymania i rozwoju dużych projektów\n– Kompatybilność z JavaScript i nowoczesnymi frameworkami (React, Node.js)\n\nWdrażając TypeScript w Hello Software, tworzymy aplikacje szybciej, bezpieczniej i bardziej skalowal"
  },
  "REACT": {
    "title": "React",
    "link": "React",
    "caption": "Dynamiczne i szybkie interfejsy użytkownika – tworzone z React.",
    "motto": "Dynamiczne i szybkie interfejsy użytkownika",
    "metadata": {
      "title": "React – Hello Software",
      "description": "Tworzymy front-endy aplikacji w React – szybkie, skalowalne i nowoczesne."
    },
    "text": "React to biblioteka JavaScript stworzona przez Facebooka, służąca do budowy nowoczesnych i interaktywnych interfejsów użytkownika.\n\nW Hello Software React jest naszym głównym narzędziem do tworzenia stron internetowych, aplikacji webowych i PWA (Progressive Web Apps).\n\nZ Reactem oferujemy:\n– Błyskawiczne ładowanie i płynne działanie stron (SPA)\n– Komponentową architekturę ułatwiającą rozwój i testowanie\n– Wysoką wydajność i optymalizację SEO z Next.js\n– Świetną integrację z backendem przez REST lub GraphQL\n\nWybierając React z Hello Software, inwestujesz w przyszłościowy i elastyczny frontend, który zachwyci Twoich użytkowników."
  },
  "NODE_JS": {
    "title": "Node.js",
    "link": "Node.js",
    "caption": "Aplikacje backendowe i API w Node.js – skalowalne i wydajne.",
    "motto": "Szybkie i skalowalne backendy w JavaScript",
    "metadata": {
      "title": "Node.js – Hello Software",
      "description": "Tworzymy backendy i API w Node.js – elastyczne i szybkie rozwiązania serwerowe."
    },
    "text": "Node.js pozwala tworzyć wydajne aplikacje po stronie serwera w tym samym języku co frontend – JavaScript.\n\nW Hello Software używamy Node.js do budowy backendów, API oraz systemów wymagających wysokiej wydajności i skalowalności.\n\nDlaczego warto postawić na Node.js:\n– Jednolity stack technologiczny (JavaScript wszędzie)\n– Obsługa wielu zapytań jednocześnie dzięki asynchroniczności\n– Świetne do aplikacji real-time (czaty, notyfikacje, streaming)\n– Bogaty ekosystem bibliotek (NPM)\n\nHello Software dostarcza solidne backendy zbudowane na Node.js – gotowe na rozwój i integracje."
  },
  "REACT_NATIVE": {
    "title": "React Native",
    "link": "React Native",
    "caption": "Tworzenie aplikacji mobilnych z React Native – jedno źródło kodu dla iOS i Android.",
    "motto": "Aplikacje mobilne na Android i iOS z jednego kodu",
    "metadata": {
      "title": "React Native – Hello Software",
      "description": "Tworzymy aplikacje mobilne z React Native – szybko, wydajnie i nowocześnie."
    },
    "text": "React Native umożliwia tworzenie natywnych aplikacji mobilnych przy użyciu JavaScript i React – z jednego kodu na oba systemy: Android i iOS.\n\nW Hello Software React Native to nasze narzędzie do tworzenia wydajnych i estetycznych aplikacji mobilnych z krótszym czasem developmentu.\n\nCo zyskujesz z React Native:\n– Oszczędność czasu i budżetu – jeden kod, dwa systemy\n– Wydajność zbliżona do aplikacji natywnych\n– Szybkie aktualizacje i wdrożenia dzięki Hot Reloading\n– Możliwość integracji z natywnymi komponentami (kamera, GPS, Bluetooth)\n\nHello Software tworzy aplikacje mobilne, które wyglądają i działają doskonale – bez kompromisów między platformami."
  },
  "ABOUT_US": {
    "title": "O Nas - Hello Software",
    "link": "O nas",
    "caption": "Poznaj nas, wartości i podejście do tworzenia oprogramowania.",
    "metadata": {
      "title": "O nas – Hello Software",
      "description": "Poznaj naszą firmę, wartości i sposób pracy przy tworzeniu rozwiązań IT."
    },
    "sections_1": {
      "title": "Nasze Wartości",
      "caption": "Fundamenty, które kształtują każdy nasz projekt.",
      "text": "W Hello Software kierujemy się wartościami takimi jak transparentność, innowacyjność, odpowiedzialność i zaangażowanie. Wierzymy, że tylko poprzez partnerską współpracę i uczciwość jesteśmy w stanie dostarczać najwyższej jakości rozwiązania IT, które realnie wspierają rozwój biznesów naszych klientów."
    },
    "sections_2": {
      "title": "Nasza kultura organizacyjna",
      "caption": "Zespół napędzany pasją i wzajemnym szacunkiem.",
      "text": "Tworzymy środowisko pracy, w którym liczy się współpraca, otwarta komunikacja i ciągły rozwój. W Hello Software każdy członek zespołu ma realny wpływ na projekty i firmę. Promujemy kulturę feedbacku, elastyczności oraz równowagi między życiem zawodowym a prywatnym, co przekłada się na efektywność i kreatywność w działaniu."
    },
    "sections_3": {
      "title": "Nasza Wizja",
      "caption": "Nowoczesne technologie w służbie ludzi i biznesu.",
      "text": "Naszą wizją jest tworzenie inteligentnych, skalowalnych i dostępnych rozwiązań IT, które odpowiadają na dynamiczne potrzeby rynku. Dążymy do bycia zaufanym partnerem technologicznym dla firm z całego świata, wspierając ich w cyfrowej transformacji i osiąganiu celów biznesowych."
    },
    "sections_4": {
      "title": "Dlaczego wybrać nas?",
      "caption": "Twoje cele biznesowe w rękach doświadczonego zespołu IT.",
      "text": "Wybierając Hello Software, zyskujesz partnera, który rozumie Twoje potrzeby i potrafi przełożyć je na skuteczne rozwiązania technologiczne. Łączymy doświadczenie, nowoczesne podejście i transparentność w działaniu. Nasze projekty powstają w oparciu o analizę, strategię i najwyższe standardy jakości – od koncepcji po wdrożenie i dalsze wsparcie."
    }
  },
  "CONTACT": {
    "title": "Kontakt z Hello Software",
    "link": "Kontakt",
    "caption": "Chcesz stworzyć stronę internetową, aplikację lub sklep online? Skontaktuj się z naszym zespołem ekspertów IT i omów swój projekt.",
    "metadata": {
      "title": "Skontaktuj się z Hello Software – Profesjonalne usługi IT",
      "description": "Masz pomysł na projekt IT? Skontaktuj się z Hello Software i uzyskaj darmową konsultację w zakresie tworzenia stron, aplikacji mobilnych i e-commerce."
    },
    "CONNTACT_SECTION": {
      "form": {
        "title": "Potrzebujesz strony internetowej lub aplikacji?",
        "caption": "Napisz do nas",
        "input": {
          "email": {
            "placeholder": "Adres e-mail *",
            "error": "Wprowadź poprawny adres e-mail"
          },
          "name": {
            "placeholder": "Imię",
            "error": "Podaj poprawne imię"
          },
          "phone": {
            "placeholder": "Numer telefonu",
            "error": "Podaj poprawny numer telefonu"
          },
          "message": {
            "placeholder": "Opisz swój projekt *",
            "error": "Opis projektu powinien zawierać co najmniej 10 znaków"
          }
        },
        "submit": "Wyślij wiadomość",
        "sending": "Wysyłanie...",
        "success": "Wiadomość została wysłana. Skontaktujemy się z Tobą wkrótce!",
        "error": "Wystąpił błąd. Spróbuj ponownie później."
      },
      "informations": {
        "title": "Nasze dane kontaktowe",
        "caption": "Skontaktuj się z nami – doradzimy, zaproponujemy rozwiązania i przygotujemy wycenę projektu IT",
        "location": {
          "title": "Nasza lokalizacja",
          "detail": "Wrocław, Polska"
        },
        "mail": {
          "title": "Napisz do nas",
          "detail": "contact@hello-software.com"
        }
      }
    }
  },
  "SUPPORT": {
    "title": "Przydatne Linki",
    "link": "Przydatne Linki",
    "caption": "Dostęp do przydatnych zasobów, dokumentacji i polityk związanych z naszymi usługami.",
    "metadata": {
      "title": "Przydatne Linki – Hello Software",
      "description": "Poznaj ważne linki i materiały pomocnicze od Hello Software, aby być na bieżąco i uzyskać wsparcie."
    }
  },
  "TERMS": {
    "title": "Regulamin",
    "link": "Regulamin",
    "caption": "Poznaj warunki korzystania z naszych usług oraz zasady obowiązujące na stronie.",
    "metadata": {
      "title": "Regulamin – Hello Software",
      "description": "Zapoznaj się z regulaminem Hello Software, aby dowiedzieć się więcej o zasadach korzystania z naszych usług."
    },
    "rules": [
      {
        "title": "1. Definicje",
        "content": "Usługodawca – JavaScript Solutions Igor Dudek, działający pod nazwą Hello Software, NIP 8943163760, email kontaktowy: contact@hello-software.com.\n\nUżytkownik – osoba lub podmiot korzystający z usług świadczonych przez Usługodawcę, takich jak tworzenie stron internetowych, aplikacji mobilnych, systemów e-commerce i innych rozwiązań IT."
      },
      {
        "title": "2. Zakres usług",
        "content": "Hello Software świadczy kompleksowe usługi IT, w tym:\n\n- Tworzenie nowoczesnych stron internetowych,\n- Budowanie aplikacji mobilnych na Androida i iOS,\n- Rozwiązania e-commerce, w tym sklepy internetowe,\n- Tworzenie aplikacji webowych i backendowych,\n- Integracje systemowe oraz API,\n- Optymalizacja SEO, usługi chmurowe i outsourcing IT."
      },
      {
        "title": "3. Warunki korzystania z usług",
        "content": "Usługodawca dostarcza usługi na podstawie umowy zawartej z Użytkownikiem.\n\nUżytkownik zobowiązuje się do korzystania z usług Usługodawcy zgodnie z obowiązującym prawem.\n\nUsługodawca ma prawo do modyfikacji oferty usług w dowolnym momencie."
      },
      {
        "title": "4. Płatności",
        "content": "Opłaty za usługi są uzgadniane indywidualnie w ramach zawartych umów."
      },
      {
        "title": "5. Reklamacje",
        "content": "Reklamacje dotyczące świadczonych usług należy zgłaszać na adres email: [email kontaktowy]."
      },
      {
        "title": "6. Odpowiedzialność",
        "content": "Usługodawca nie ponosi odpowiedzialności za szkody wynikłe z niewłaściwego korzystania z usług, ani za opóźnienia spowodowane działaniem siły wyższej."
      },
      {
        "title": "7. Rozwiązywanie umowy",
        "content": "Użytkownik i Usługodawca mogą rozwiązać umowę na mocy porozumienia stron lub zgodnie z warunkami określonymi w umowie."
      },
      {
        "title": "8. Zmiany regulaminu",
        "content": "Usługodawca zastrzega sobie prawo do wprowadzenia zmian w regulaminie, informując o tym użytkowników."
      }
    ]
  },
  "POLICY": {
    "title": "Polityka Prywatności",
    "link": "Polityka Prywatności",
    "caption": "Dowiedz się, jak dbamy o Twoją prywatność i przetwarzamy dane osobowe.",
    "metadata": {
      "title": "Polityka Prywatności – Hello Software",
      "description": "Sprawdź, jak Hello Software przetwarza i chroni Twoje dane osobowe zgodnie z przepisami RODO."
    },
    "rules": [
      {
        "title": "1. Administrator danych osobowych",
        "content": "Administratorem danych osobowych jest JavaScript Solutions Igor Dudek, działający pod nazwą Hello Software, NIP 8943163760, email kontaktowy: contact@hello-software.com."
      },
      {
        "title": "2. Cele przetwarzania danych",
        "content": "Przetwarzamy dane osobowe w celu świadczenia usług IT, w tym projektowania i rozwoju stron internetowych, aplikacji mobilnych, systemów e-commerce, API i integracji, a także w celach marketingowych, jeżeli użytkownik wyrazi na to zgodę."
      },
      {
        "title": "3. Podstawa prawna przetwarzania",
        "content": "Przetwarzanie danych osobowych odbywa się na podstawie zgody użytkownika, realizacji umowy, a także uzasadnionego interesu administratora."
      },
      {
        "title": "4. Zakres przetwarzanych danych",
        "content": "Zbieramy dane takie jak: imię, nazwisko, adres email (jeśli dobrowolnie przekazane), dane analityczne o użytkowaniu strony internetowej (Google Analytics)."
      },
      {
        "title": "5. Odbiorcy danych",
        "content": "Dane mogą być przekazywane do podmiotów świadczących usługi techniczne, w tym dostawców usług hostingowych, firm zajmujących się analityką internetową (np. Google Analytics), a także zewnętrznych partnerów w ramach realizacji umów."
      },
      {
        "title": "6. Przekazywanie danych poza EOG",
        "content": "Dane mogą być przekazywane do krajów spoza EOG, w szczególności do Google (USA) w ramach korzystania z Google Analytics. Google zapewnia odpowiednie zabezpieczenia danych."
      },
      {
        "title": "7. Prawa użytkowników",
        "content": "Użytkownik ma prawo do dostępu, sprostowania, usunięcia, przenoszenia danych oraz do ograniczenia przetwarzania danych. Może także wycofać zgodę w dowolnym momencie, kontaktując się z administratorem danych."
      },
      {
        "title": "8. Kontakt w sprawach danych osobowych",
        "content": "W celu skorzystania z przysługujących praw, użytkownik może kontaktować się z administratorem danych na adres email: contact@hello-software.com."
      },
      {
        "title": "9. Przechowywanie danych",
        "content": "Dane osobowe przechowujemy przez czas trwania umowy oraz przez okres wymagany przepisami prawa, w zależności od rodzaju danych."
      }
    ]
  },
  "COOKIES": {
    "title": "Polityka Cookies",
    "link": "Cookies",
    "caption": "Dowiedz się, jak korzystamy z plików cookies, aby ulepszać naszą stronę.",
    "metadata": {
      "title": "Polityka Cookies – Hello Software",
      "description": "Zobacz, jak Hello Software wykorzystuje pliki cookies w celu poprawy działania strony i analizy ruchu."
    },
    "rules": [
      {
        "title": "1. Czym są pliki cookies",
        "content": "Cookies to małe pliki tekstowe przechowywane w urządzeniu użytkownika, które umożliwiają identyfikację urządzenia i przechowywanie informacji o sesjach użytkownika."
      },
      {
        "title": "2. Rodzaje plików cookies",
        "content": "Niezbędne pliki cookies – umożliwiają korzystanie z podstawowych funkcji strony.\n\nAnalityczne pliki cookies – umożliwiają nam zbieranie anonimowych danych o sposobie korzystania z witryny, np. Google Analytics."
      },
      {
        "title": "3. Cel stosowania cookies",
        "content": "Pliki cookies służą do poprawy funkcjonalności strony, analizy ruchu oraz dostosowywania treści do potrzeb użytkowników. W szczególności, używamy Google Analytics do monitorowania użytkowania strony."
      },
      {
        "title": "4. Zgoda na cookies",
        "content": "Korzystając ze strony, użytkownik wyraża zgodę na stosowanie plików cookies. Zgodę można wycofać w każdej chwili, zmieniając ustawienia przeglądarki."
      },
      {
        "title": "5. Zarządzanie plikami cookies",
        "content": "Użytkownik może w każdej chwili zmienić ustawienia cookies w swojej przeglądarce. Instrukcje zmiany ustawień cookies są dostępne w dokumentacji przeglądarek internetowych."
      },
      {
        "title": "6. Google Analytics",
        "content": "Na naszej stronie używamy Google Analytics do analizy ruchu na stronie. Informacje o plikach cookies Google Analytics dostępne są w Polityce prywatności Google."
      }
    ]
  },
  "FOOTER": {
    "title": "Chcesz, abyśmy się z Tobą skontaktowali?<br></br>Zostaw swój adres e-mail poniżej",
    "caption": "Hello Software tworzy nowoczesne i przyjazne użytkownikowi rozwiązania IT, które usprawniają procesy biznesowe. Skupiamy się na wydajności, skalowalności i prostocie, dostarczając narzędzia wspierające rozwój Twojej firmy.",
    "form": {
      "email": {
        "placeholder": "Adres e-mail *"
      },
      "error": {
        "general": "Wystąpił błąd. Spróbuj ponownie później.",
        "email": "Wprowadź poprawny adres e-mail"
      },
      "success": "Wiadomość została wysłana. Skontaktujemy się z Tobą wkrótce!",
      "button": {
        "default": "Kontakt",
        "sending": "Wysyłanie..."
      }
    },
    "all-rights-reserved": "© Hello Software 2025. Wszelkie prawa zastrzeżone.",
    "STATS_SECTION": [
      { "title": "5+", "caption": "Lat doświadczenia" },
      { "title": "Z Polski", "caption": "Dostępni globalnie" },
      { "title": "+100%", "caption": "Wzrost od początku działalności" }
    ]
  },
  "COOKIES_BANNER": {
    "title": "Pliki cookies",
    "link": "Polityka cookies",
    "caption": "Używamy plików cookies, aby zapewnić prawidłowe działanie strony, analizować ruch oraz wyświetlać dopasowane reklamy. Możesz zarządzać swoimi zgodami lub zaakceptować wszystkie, aby korzystać z pełnej funkcjonalności serwisu. Twoje dane są przetwarzane zgodnie z RODO i wykorzystywane wyłącznie w określonych celach.",
    "preferences": {
      "ad_storage": "Cookies reklamowe – umożliwiają przechowywanie danych związanych z reklamami w celu wyświetlania spersonalizowanych ogłoszeń dopasowanych do zainteresowań użytkownika",
      "analytics_storage": "Cookies analityczne – pozwalają na zbieranie danych, takich jak odwiedzane strony i czas spędzony w serwisie, co pomaga w optymalizacji witryny pod kątem doświadczenia użytkownika.",
      "personalization_storage": "Cookies personalizacyjne – zapisują preferencje użytkownika, aby zapewnić spersonalizowaną nawigację podczas kolejnych wizyt.",
      "ad_user_data": "Cookies danych użytkownika – umożliwiają przekazywanie anonimowych danych użytkownika do systemów reklamowych, np. Google Ads, w celu lepszego targetowania reklam.",
      "ad_personalization": "Cookies marketingowe – wspierają personalizację treści reklamowych na podstawie zachowania użytkownika, zwiększając trafność wyświetlanych reklam."
    },
    "button": {
      "settings": {
        "open": "Ustawienia cookies",
        "close": "Zamknij ustawienia"
      },
      "reject": "Odrzuć wszystkie",
      "submit": {
        "custom": "Zatwierdź wybrane",
        "acceptAll": "Akceptuj wszystkie"
      }
    }
  }
}
