{
  "HOME_PAGE": {
    "title": "Hello",
    "link": "Strona Główna",
    "caption": "Nowoczesne strony, aplikacje mobilne i systemy IT – kompleksowe wsparcie technologiczne.",
    "metadata": {
      "title": "Hello Software – Tworzenie Stron i Aplikacji",
      "description": "Software House zajmujący się tworzeniem stron internetowych, aplikacjami mobilnymi i webowymi oraz zapewniamy wsparcie IT dla firm."
    },
    "HERO_SECTION": {
      "text": "Jesteśmy doświadczonym software housem, który dostarcza kompleksowe rozwiązania IT dostosowane do potrzeb Twojej firmy. Projektujemy szybkie, responsywne i zoptymalizowane strony www, funkcjonalne aplikacje mobilne na Androida i iOS oraz skalowalne systemy e-commerce. Szukasz niezawodnego partnera technologicznego? Skontaktuj się z nami – zaprojektujemy rozwiązanie idealne dla Twojego biznesu",
      "button": "Skontaktuj się z nami"
    },
    "SERVICES_SECTION": {},
    "HOW_IT_WORK_SECTION": {
      "title": "Proces Rozwoju Oprogramowania",
      "caption": "Poznaj każdy etap naszej pracy – od strategii i projektowania UX, aż po wdrożenie i optymalizację. Upraszczamy złożone procesy, dostarczając szybkie, skalowalne i przyjazne użytkownikom rozwiązania.",
      "steps": [
        {
          "title": "Strategia i Projektowanie UX",
          "description": "Określamy cele biznesowe, grupę docelową i kluczowe funkcje. Tworzymy makiety oraz finalne projekty graficzne, zapewniające intuicyjną nawigację i układ zwiększający konwersje."
        },
        {
          "title": "Rozwój Front-End i Back-End",
          "description": "Zamieniamy zaakceptowane projekty w szybkie i responsywne strony internetowe z wykorzystaniem nowoczesnych technologii jak React. W razie potrzeby wdrażamy skalowalną architekturę backendu."
        },
        {
          "title": "Testy, Optymalizacja i Wdrożenie",
          "description": "Przeprowadzamy dokładne testy wydajności, responsywności, zgodności z SEO i bezpieczeństwa. Usuwamy błędy, optymalizujemy szybkość ładowania i wdrażamy witrynę na niezawodnym serwerze z integracją analityki."
        }
      ],
      "STATS_SECTION": [
        { "title": "5+", "caption": "Lat doświadczenia" },
        { "title": "Z Polski", "caption": "Dostępni globalnie" },
        { "title": "+100%", "caption": "Wzrost od początku działalności" }
      ]
    },
    "CONNTACT_SECTION": {
      "form": {
        "title": "Potrzebujesz strony internetowej lub aplikacji?",
        "caption": "Napisz do nas",
        "input": {
          "email": {
            "placeholder": "Adres e-mail *",
            "error": "Wprowadź poprawny adres e-mail"
          },
          "name": {
            "placeholder": "Imię",
            "error": "Podaj poprawne imię"
          },
          "phone": {
            "placeholder": "Numer telefonu",
            "error": "Podaj poprawny numer telefonu"
          },
          "message": {
            "placeholder": "Opisz swój projekt *",
            "error": "Opis projektu powinien zawierać co najmniej 10 znaków"
          }
        },
        "submit": "Wyślij wiadomość",
        "sending": "Wysyłanie...",
        "success": "Wiadomość została wysłana. Skontaktujemy się z Tobą wkrótce!",
        "error": "Wystąpił błąd. Spróbuj ponownie później."
      },
      "informations": {
        "title": "Nasze dane kontaktowe",
        "caption": "Skontaktuj się z nami – doradzimy, zaproponujemy rozwiązania i przygotujemy wycenę projektu IT",
        "location": {
          "title": "Nasza lokalizacja",
          "detail": "Wrocław, Polska"
        },
        "mail": {
          "title": "Napisz do nas",
          "detail": "contact@hello-software.com"
        }
      }
    }
  },
  "SERVICES": {
    "title": "Usługi",
    "link": "Usługi",
    "caption": "Oferta usług programistycznych dostosowanych do potrzeb Twojej firmy",
    "motto": "Zamień swój pomysł w realny biznes",
    "metadata": {
      "title": "Usługi IT – Hello Software",
      "description": "Oferujemy strony internetowe, aplikacje mobilne, integracje API i rozwiązania chmurowe."
    },
    "section": {
      "title": "Nowoczesne Usługi, które Oferujemy",
      "motto": "Zamień swój pomysł w realny biznes"
    },
    "STATS_SECTION": [
      { "title": "5+", "caption": "Lat doświadczenia" },
      { "title": "Na całym świecie", "caption": "Z Polski, dostępni globalnie" },
      { "title": "+100%", "caption": "Wzrost od początku działalności" }
    ]
  },
  "WEBSITES": {
    "title": "Strony Internetowe",
    "link": "Strony Internetowe",
    "button": { "read_more": "Zobacz Więcej" },
    "caption": "Nowoczesne strony internetowe – szybkie, responsywne i zoptymalizowane pod SEO.",
    "metadata": {
      "title": "Strony Internetowe – Hello Software",
      "description": "Projektujemy nowoczesne strony www zoptymalizowane pod kątem SEO i UX."
    }
  },
  "E_COMMERCE": {
    "title": "Sklepy Internetowe",
    "link": "E-Commerce",
    "button": { "read_more": "Zobacz Więcej" },
    "caption": "Bezpieczne i skalowalne sklepy internetowe – maksymalizacja konwersji.",
    "metadata": {
      "title": "Sklepy Internetowe – Hello Software",
      "description": "Tworzymy sklepy e-commerce skoncentrowane na wydajności i konwersji."
    }
  },
  "WEB_APPLICATIONS": {
    "title": "Aplikacje Internetowe",
    "link": "Aplikacje Internetowe",
    "button": { "read_more": "Zobacz Więcej" },
    "caption": "Skalowalne aplikacje webowe dopasowane do Twoich potrzeb biznesowych.",
    "metadata": {
      "title": "Aplikacje Internetowe – Hello Software",
      "description": "Tworzymy wydajne aplikacje webowe z wykorzystaniem nowoczesnych technologii."
    }
  },
  "MOBILE_APPLICATIONS": {
    "title": "Aplikacje Mobilne",
    "link": "Aplikacje Mobilne",
    "button": { "read_more": "Zobacz Więcej" },
    "caption": "Nowoczesne aplikacje mobilne Android i iOS – intuicyjne i wydajne.",
    "metadata": {
      "title": "Aplikacje Mobilne – Hello Software",
      "description": "Budujemy szybkie i intuicyjne aplikacje mobilne na Androida i iOS."
    }
  },
  "SERVER_APPLICATIONS": {
    "title": "API i Integracje",
    "link": "Integracje Systemowe",
    "button": { "read_more": "Zobacz Więcej" },
    "caption": "Tworzenie API i integracji systemowych – automatyzacja i łączność.",
    "metadata": {
      "title": "API i Integracje – Hello Software",
      "description": "Tworzymy API oraz integracje między systemami w celu automatyzacji i optymalizacji."
    }
  },
  "SEARCH_ENGINE_OPTIMIZATION": {
    "title": "Pozycjonowanie SEO",
    "link": "Pozycjonowanie",
    "button": { "read_more": "Zobacz Więcej" },
    "caption": "Zwiększ widoczność strony – skuteczne działania SEO dla większego ruchu.",
    "metadata": {
      "title": "SEO – Hello Software",
      "description": "Popraw widoczność strony w Google dzięki skutecznym technikom SEO."
    }
  },
  "CLOUD_COMPUTING_SOLUTIONS": {
    "title": "Rozwiązania Chmurowe",
    "link": "Rozwiązania Chmurowe",
    "button": { "read_more": "Zobacz Więcej" },
    "caption": "Bezpieczne i skalowalne rozwiązania chmurowe dla firm.",
    "metadata": {
      "title": "Rozwiązania Chmurowe – Hello Software",
      "description": "Nowoczesne usługi chmurowe – bezpieczeństwo, wydajność i elastyczność."
    }
  },
  "OUTSOURCING": {
    "title": "Outsourcing IT",
    "link": "Outsourcing",
    "button": { "read_more": "Zobacz Więcej" },
    "caption": "Zewnętrzne zespoły IT – oszczędność i profesjonalne wsparcie techniczne.",
    "metadata": {
      "title": "Outsourcing IT – Hello Software",
      "description": "Oferujemy zespoły IT na zewnątrz – elastyczność i wysoka jakość usług."
    }
  },
  "TECHNOLOGIES": {
    "title": "Technologie",
    "link": "Technologie",
    "caption": "Nowoczesne technologie, które napędzają nasze projekty IT.",
    "metadata": {
      "title": "Technologie – Hello Software",
      "description": "Poznaj technologie, które wykorzystujemy w projektach IT."
    }
  },
  "TYPESCRIPT": {
    "title": "TypeScript",
    "link": "TypeScript",
    "caption": "Bezpieczne aplikacje w języku TypeScript – lepszy kod, mniej błędów.",
    "metadata": {
      "title": "TypeScript – Hello Software",
      "description": "Tworzymy aplikacje w TypeScript – nowoczesnym i typowanym języku JavaScript."
    }
  },
  "REACT": {
    "title": "React",
    "link": "React",
    "caption": "Dynamiczne i szybkie interfejsy użytkownika – tworzone z React.",
    "metadata": {
      "title": "React – Hello Software",
      "description": "Tworzymy front-endy aplikacji w React – szybkie, skalowalne i nowoczesne."
    }
  },
  "NODE_JS": {
    "title": "Node.js",
    "link": "Node.js",
    "caption": "Aplikacje backendowe i API w Node.js – skalowalne i wydajne.",
    "metadata": {
      "title": "Node.js – Hello Software",
      "description": "Tworzymy backendy i API w Node.js – elastyczne i szybkie rozwiązania serwerowe."
    }
  },
  "REACT_NATIVE": {
    "title": "React Native",
    "link": "React Native",
    "caption": "Tworzenie aplikacji mobilnych z React Native – jedno źródło kodu dla iOS i Android.",
    "metadata": {
      "title": "React Native – Hello Software",
      "description": "Tworzymy aplikacje mobilne z React Native – szybko, wydajnie i nowocześnie."
    }
  },
  "ABOUT_US": {
    "title": "O Nas - Hello Software",
    "link": "O nas",
    "caption": "Poznaj nas, wartości i podejście do tworzenia oprogramowania.",
    "metadata": {
      "title": "O nas – Hello Software",
      "description": "Poznaj naszą firmę, wartości i sposób pracy przy tworzeniu rozwiązań IT."
    },
    "sections_1": {
      "title": "Nasze Wartości",
      "caption": "Fundamenty, które kształtują każdy nasz projekt.",
      "text": "W Hello Software kierujemy się wartościami takimi jak transparentność, innowacyjność, odpowiedzialność i zaangażowanie. Wierzymy, że tylko poprzez partnerską współpracę i uczciwość jesteśmy w stanie dostarczać najwyższej jakości rozwiązania IT, które realnie wspierają rozwój biznesów naszych klientów."
    },
    "sections_2": {
      "title": "Nasza kultura organizacyjna",
      "caption": "Zespół napędzany pasją i wzajemnym szacunkiem.",
      "text": "Tworzymy środowisko pracy, w którym liczy się współpraca, otwarta komunikacja i ciągły rozwój. W Hello Software każdy członek zespołu ma realny wpływ na projekty i firmę. Promujemy kulturę feedbacku, elastyczności oraz równowagi między życiem zawodowym a prywatnym, co przekłada się na efektywność i kreatywność w działaniu."
    },
    "sections_3": {
      "title": "Nasza Wizja",
      "caption": "Nowoczesne technologie w służbie ludzi i biznesu.",
      "text": "Naszą wizją jest tworzenie inteligentnych, skalowalnych i dostępnych rozwiązań IT, które odpowiadają na dynamiczne potrzeby rynku. Dążymy do bycia zaufanym partnerem technologicznym dla firm z całego świata, wspierając ich w cyfrowej transformacji i osiąganiu celów biznesowych."
    },
    "sections_4": {
      "title": "Dlaczego wybrać nas?",
      "caption": "Twoje cele biznesowe w rękach doświadczonego zespołu IT.",
      "text": "Wybierając Hello Software, zyskujesz partnera, który rozumie Twoje potrzeby i potrafi przełożyć je na skuteczne rozwiązania technologiczne. Łączymy doświadczenie, nowoczesne podejście i transparentność w działaniu. Nasze projekty powstają w oparciu o analizę, strategię i najwyższe standardy jakości – od koncepcji po wdrożenie i dalsze wsparcie."
    }
  },
  "CONTACT": {
    "title": "Kontakt z Hello Software",
    "link": "Kontakt",
    "caption": "Chcesz stworzyć stronę internetową, aplikację lub sklep online? Skontaktuj się z naszym zespołem ekspertów IT i omów swój projekt.",
    "metadata": {
      "title": "Skontaktuj się z Hello Software – Profesjonalne usługi IT",
      "description": "Masz pomysł na projekt IT? Skontaktuj się z Hello Software i uzyskaj darmową konsultację w zakresie tworzenia stron, aplikacji mobilnych i e-commerce."
    },
    "CONNTACT_SECTION": {
      "form": {
        "title": "Potrzebujesz strony internetowej lub aplikacji?",
        "caption": "Napisz do nas",
        "input": {
          "email": {
            "placeholder": "Adres e-mail *",
            "error": "Wprowadź poprawny adres e-mail"
          },
          "name": {
            "placeholder": "Imię",
            "error": "Podaj poprawne imię"
          },
          "phone": {
            "placeholder": "Numer telefonu",
            "error": "Podaj poprawny numer telefonu"
          },
          "message": {
            "placeholder": "Opisz swój projekt *",
            "error": "Opis projektu powinien zawierać co najmniej 10 znaków"
          }
        },
        "submit": "Wyślij wiadomość",
        "sending": "Wysyłanie...",
        "success": "Wiadomość została wysłana. Skontaktujemy się z Tobą wkrótce!",
        "error": "Wystąpił błąd. Spróbuj ponownie później."
      },
      "informations": {
        "title": "Nasze dane kontaktowe",
        "caption": "Skontaktuj się z nami – doradzimy, zaproponujemy rozwiązania i przygotujemy wycenę projektu IT",
        "location": {
          "title": "Nasza lokalizacja",
          "detail": "Wrocław, Polska"
        },
        "mail": {
          "title": "Napisz do nas",
          "detail": "contact@hello-software.com"
        }
      }
    }
  },
  "SUPPORT": {
    "title": "Przydatne Linki",
    "link": "Przydatne Linki",
    "caption": "Dostęp do przydatnych zasobów, dokumentacji i polityk związanych z naszymi usługami.",
    "metadata": {
      "title": "Przydatne Linki – Hello Software",
      "description": "Poznaj ważne linki i materiały pomocnicze od Hello Software, aby być na bieżąco i uzyskać wsparcie."
    }
  },
  "TERMS": {
    "title": "Regulamin Hello Software",
    "link": "Regulamin",
    "caption": "Poznaj warunki korzystania z naszych usług oraz zasady obowiązujące na stronie.",
    "metadata": {
      "title": "Regulamin – Hello Software",
      "description": "Zapoznaj się z regulaminem Hello Software, aby dowiedzieć się więcej o zasadach korzystania z naszych usług."
    },
    "rules": [
      {
        "title": "1. Definicje",
        "content": "Usługodawca – JavaScript Solutions Igor Dudek, działający pod nazwą Hello Software, NIP 8943163760, email kontaktowy: contact@hello-software.com.\n\nUżytkownik – osoba lub podmiot korzystający z usług świadczonych przez Usługodawcę, takich jak tworzenie stron internetowych, aplikacji mobilnych, systemów e-commerce i innych rozwiązań IT."
      },
      {
        "title": "2. Zakres usług",
        "content": "Hello Software świadczy kompleksowe usługi IT, w tym:\n\n- Tworzenie nowoczesnych stron internetowych,\n- Budowanie aplikacji mobilnych na Androida i iOS,\n- Rozwiązania e-commerce, w tym sklepy internetowe,\n- Tworzenie aplikacji webowych i backendowych,\n- Integracje systemowe oraz API,\n- Optymalizacja SEO, usługi chmurowe i outsourcing IT."
      },
      {
        "title": "3. Warunki korzystania z usług",
        "content": "Usługodawca dostarcza usługi na podstawie umowy zawartej z Użytkownikiem.\n\nUżytkownik zobowiązuje się do korzystania z usług Usługodawcy zgodnie z obowiązującym prawem.\n\nUsługodawca ma prawo do modyfikacji oferty usług w dowolnym momencie."
      },
      {
        "title": "4. Płatności",
        "content": "Opłaty za usługi są uzgadniane indywidualnie w ramach zawartych umów."
      },
      {
        "title": "5. Reklamacje",
        "content": "Reklamacje dotyczące świadczonych usług należy zgłaszać na adres email: [email kontaktowy]."
      },
      {
        "title": "6. Odpowiedzialność",
        "content": "Usługodawca nie ponosi odpowiedzialności za szkody wynikłe z niewłaściwego korzystania z usług, ani za opóźnienia spowodowane działaniem siły wyższej."
      },
      {
        "title": "7. Rozwiązywanie umowy",
        "content": "Użytkownik i Usługodawca mogą rozwiązać umowę na mocy porozumienia stron lub zgodnie z warunkami określonymi w umowie."
      },
      {
        "title": "8. Zmiany regulaminu",
        "content": "Usługodawca zastrzega sobie prawo do wprowadzenia zmian w regulaminie, informując o tym użytkowników."
      }
    ]
  },
  "POLICY": {
    "title": "Polityka Prywatności Hello Software",
    "link": "Polityka Prywatności",
    "caption": "Dowiedz się, jak dbamy o Twoją prywatność i przetwarzamy dane osobowe.",
    "metadata": {
      "title": "Polityka Prywatności – Hello Software",
      "description": "Sprawdź, jak Hello Software przetwarza i chroni Twoje dane osobowe zgodnie z przepisami RODO."
    },
    "rules": [
      {
        "title": "1. Administrator danych osobowych",
        "content": "Administratorem danych osobowych jest JavaScript Solutions Igor Dudek, działający pod nazwą Hello Software, NIP 8943163760, email kontaktowy: contact@hello-software.com."
      },
      {
        "title": "2. Cele przetwarzania danych",
        "content": "Przetwarzamy dane osobowe w celu świadczenia usług IT, w tym projektowania i rozwoju stron internetowych, aplikacji mobilnych, systemów e-commerce, API i integracji, a także w celach marketingowych, jeżeli użytkownik wyrazi na to zgodę."
      },
      {
        "title": "3. Podstawa prawna przetwarzania",
        "content": "Przetwarzanie danych osobowych odbywa się na podstawie zgody użytkownika, realizacji umowy, a także uzasadnionego interesu administratora."
      },
      {
        "title": "4. Zakres przetwarzanych danych",
        "content": "Zbieramy dane takie jak: imię, nazwisko, adres email (jeśli dobrowolnie przekazane), dane analityczne o użytkowaniu strony internetowej (Google Analytics)."
      },
      {
        "title": "5. Odbiorcy danych",
        "content": "Dane mogą być przekazywane do podmiotów świadczących usługi techniczne, w tym dostawców usług hostingowych, firm zajmujących się analityką internetową (np. Google Analytics), a także zewnętrznych partnerów w ramach realizacji umów."
      },
      {
        "title": "6. Przekazywanie danych poza EOG",
        "content": "Dane mogą być przekazywane do krajów spoza EOG, w szczególności do Google (USA) w ramach korzystania z Google Analytics. Google zapewnia odpowiednie zabezpieczenia danych."
      },
      {
        "title": "7. Prawa użytkowników",
        "content": "Użytkownik ma prawo do dostępu, sprostowania, usunięcia, przenoszenia danych oraz do ograniczenia przetwarzania danych. Może także wycofać zgodę w dowolnym momencie, kontaktując się z administratorem danych."
      },
      {
        "title": "8. Kontakt w sprawach danych osobowych",
        "content": "W celu skorzystania z przysługujących praw, użytkownik może kontaktować się z administratorem danych na adres email: contact@hello-software.com."
      },
      {
        "title": "9. Przechowywanie danych",
        "content": "Dane osobowe przechowujemy przez czas trwania umowy oraz przez okres wymagany przepisami prawa, w zależności od rodzaju danych."
      }
    ]
  },
  "COOKIES": {
    "title": "Polityka Cookies",
    "link": "Cookies",
    "caption": "Dowiedz się, jak korzystamy z plików cookies, aby ulepszać naszą stronę.",
    "metadata": {
      "title": "Polityka Cookies – Hello Software",
      "description": "Zobacz, jak Hello Software wykorzystuje pliki cookies w celu poprawy działania strony i analizy ruchu."
    },
    "rules": [
      {
        "title": "1. Czym są pliki cookies",
        "content": "Cookies to małe pliki tekstowe przechowywane w urządzeniu użytkownika, które umożliwiają identyfikację urządzenia i przechowywanie informacji o sesjach użytkownika."
      },
      {
        "title": "2. Rodzaje plików cookies",
        "content": "Niezbędne pliki cookies – umożliwiają korzystanie z podstawowych funkcji strony.\n\nAnalityczne pliki cookies – umożliwiają nam zbieranie anonimowych danych o sposobie korzystania z witryny, np. Google Analytics."
      },
      {
        "title": "3. Cel stosowania cookies",
        "content": "Pliki cookies służą do poprawy funkcjonalności strony, analizy ruchu oraz dostosowywania treści do potrzeb użytkowników. W szczególności, używamy Google Analytics do monitorowania użytkowania strony."
      },
      {
        "title": "4. Zgoda na cookies",
        "content": "Korzystając ze strony, użytkownik wyraża zgodę na stosowanie plików cookies. Zgodę można wycofać w każdej chwili, zmieniając ustawienia przeglądarki."
      },
      {
        "title": "5. Zarządzanie plikami cookies",
        "content": "Użytkownik może w każdej chwili zmienić ustawienia cookies w swojej przeglądarce. Instrukcje zmiany ustawień cookies są dostępne w dokumentacji przeglądarek internetowych."
      },
      {
        "title": "6. Google Analytics",
        "content": "Na naszej stronie używamy Google Analytics do analizy ruchu na stronie. Informacje o plikach cookies Google Analytics dostępne są w Polityce prywatności Google."
      }
    ]
  },
  "FOOTER": {
    "title": "Chcesz, abyśmy się z Tobą skontaktowali?<br></br>Zostaw swój adres e-mail poniżej",
    "caption": "Hello Software tworzy nowoczesne i przyjazne użytkownikowi rozwiązania IT, które usprawniają procesy biznesowe. Skupiamy się na wydajności, skalowalności i prostocie, dostarczając narzędzia wspierające rozwój Twojej firmy.",
    "form": {
      "email": {
        "placeholder": "Adres e-mail *"
      },
      "error": {
        "general": "Wystąpił błąd. Spróbuj ponownie później.",
        "email": "Wprowadź poprawny adres e-mail"
      },
      "success": "Wiadomość została wysłana. Skontaktujemy się z Tobą wkrótce!",
      "button": {
        "default": "Kontakt",
        "sending": "Wysyłanie..."
      }
    },
    "all-rights-reserved": "© Hello Software 2025. Wszelkie prawa zastrzeżone.",
    "STATS_SECTION": [
      { "title": "5+", "caption": "Lat doświadczenia" },
      { "title": "Z Polski", "caption": "Dostępni globalnie" },
      { "title": "+100%", "caption": "Wzrost od początku działalności" }
    ]
  },
  "COOKIES_BANNER": {
    "title": "Pliki cookies",
    "link": "Polityka cookies",
    "caption": "Wykorzystujemy pliki cookies, aby zapewnić prawidłowe działanie strony, analizować ruch oraz personalizować treści reklamowe. Zarządzaj zgodami lub zaakceptuj wszystkie, by korzystać z pełnej funkcjonalności serwisu.",
    "preferences": {
      "analytics": "Analityczne pliki cookies (np. Google Analytics) – pomagają nam mierzyć ruch i poprawiać stronę.",
      "marketing": "Marketingowe pliki cookies (np. Google Ads, Facebook Ads) – umożliwiają dopasowanie reklam do Twoich zainteresowań."
    },
    "button": {
      "settings": {
        "open": "Ustawienia cookies",
        "close": "Zamknij ustawienia"
      },
      "reject": "Odrzuć wszystkie",
      "submit": {
        "custom": "Zatwierdź wybrane",
        "acceptAll": "Akceptuj wszystkie"
      }
    }
  }
}
